{
  "what is the positively charged particle in an atom?": "Proton",
  "which type of bond involves the sharing of electrons?": "Covalent bond",
  "what is an isotope?": "A variant of an element with a different number of neutrons",
  "which particle orbits the nucleus of an atom?": "Electron",
  "what makes an isotope radioactive?": "An unstable nucleus",
  "what is a compound?": "A molecule with two different elements",
  "which bond is formed by the transfer of electrons?": "Ionic bond",
  "what is an element?": "A substance with only one type of atom",
  "what is found in the nucleus of an atom?": "Protons and neutrons",
  "what is the negatively charged particle in an atom?": "Electron",
  "what is the neutral particle in an atom?": "Neutron",
  "which type of bond is strongest in living organisms?": "Covalent bond",
  "what is the charge of a neutron?": "Neutral",
  "which type of bond is most commonly found in salts?": "Ionic bond",
  "what defines an element's atomic number?": "Number of protons",
  "what do isotopes of an element have in common?": "Number of protons",
  "what type of bond is found in a water molecule?": "Covalent bond",
  "what is the charge of an electron?": "Negative",
  "which particle determines the chemical properties of an atom?": "Electron",
  "what is the charge of a proton?": "Positive",
  "what is the function of weak interactions in biological systems?": "To facilitate temporary bonds",
  "what is the role of electrons in chemical bonding?": "They are transferred or shared",
  "which part of the atom is involved in chemical reactions?": "Electron",
  "what do you call atoms with the same number of protons but different number of neutrons?": "Isotopes",
  "which type of bond involves hydrogen atoms?": "All of the above",
  "what forms when atoms gain or lose electrons?": "Ions",
  "which is a stable isotope?": "An isotope with a stable nucleus",
  "what type of bond is found in organic molecules?": "Covalent bond",
  "what is the role of radioactive isotopes in medicine?": "They are used as tracers",
  "which of these is not a subatomic particle?": "Compound",
  "which of these is a molecule?": "O2",
  "which is not a type of chemical bond?": "Strong interaction",
  "what makes a compound different from a mixture?": "Compounds have a fixed ratio of elements",
  "what is the role of electrons in ionic bonds?": "They are transferred",
  "what is true about the number of protons and electrons in a neutral atom?": "They are equal",
  "what type of bond holds one water molecule to another?": "Hydrogen bond",
  "which of the following is not a property of water?": "Nonpolar",
  "which type of bond is within a single water molecule?": "Covalent bond",
  "what type of molecule is water?": "Polar covalent",
  "what property of water is responsible for capillary action?": "Adhesion",
  "what kind of charge does the oxygen atom have in a water molecule?": "Negative",
  "what is the term for water's ability to flow against gravity in small tubes?": "Capillary action",
  "what happens to water molecules as they freeze?": "They move farther apart",
  "how many hydrogen atoms are in a water molecule?": "2",
  "what kind of charge do the hydrogen atoms in a water molecule have?": "Positive",
  "which molecule is most likely to dissolve in water?": "Polar",
  "which of the following is a unique property of water?": "High heat capacity",
  "which of the following is least likely to dissolve in water?": "Oil",
  "what happens to the hydrogen bonds between water molecules when water boils?": "They break",
  "in which state is water least dense?": "Solid",
  "what type of bond is present between the hydrogen and oxygen atoms in a single water molecule?": "Covalent bond",
  "what property of water allows it to absorb a large amount of heat without a significant change in temperature?": "High heat capacity",
  "which of the following molecules can form hydrogen bonds with water?": "NH3",
  "what is the term for the attraction between molecules of different substances?": "Adhesion",
  "how does salt dissolve in water?": "Water molecules surround and isolate the ions",
  "which property of water allows organisms to better regulate their internal temperature?": "High heat capacity",
  "why does ice float on water?": "Ice is less dense than water",
  "what is responsible for the high surface tension of water?": "Hydrogen bonds",
  "which of the following is not a result of hydrogen bonding in water?": "Nonpolar nature",
  "which of the following substances would be most soluble in water?": "NaCl",
  "what type of bonds hold the atoms in a single water molecule together?": "Covalent bonds",
  "why do water striders (insects) glide easily on the water surface?": "High surface tension of water",
  "in what state does water have the highest density?": "Liquid",
  "why is water a good temperature buffer?": "High heat capacity",
  "what does the \"universal solvent\" refer to?": "Water",
  "why does sweating cool you down?": "Evaporation of sweat requires heat",
  "what is the term for the clinging of one substance to another?": "Adhesion",
  "which of the following is not a result of water's high heat capacity?": "Causes quick temperature changes",
  "what is the term for the attraction between molecules of the same substance?": "Cohesion",
  "why does water have a high specific heat?": "Because of its hydrogen bonds",
  "what are the building blocks of carbohydrates?": "Monosaccharides",
  "which type of reaction links monosaccharides together?": "Dehydration Synthesis",
  "what is the primary function of carbohydrates?": "Energy Source",
  "which of the following is a disaccharide?": "Lactose",
  "what does the glycemic index gi measure?": "Sugar absorption rate",
  "how do polysaccharides differ from monosaccharides?": "Complexity and function",
  "what happens during hydrolysis?": "Water is added",
  "what is the main carbohydrate found in the human body?": "Glycogen",
  "which hormone regulates blood sugar?": "Insulin",
  "what is the typical effect of carbohydrates with a high GI on blood sugar?": "Rapid rise",
  "which carbohydrate is most quickly absorbed?": "Glucose",
  "what is the complex carbohydrate found in plants?": "Starch",
  "which term describes the simplest carbohydrates?": "Monosaccharides",
  "which disease is closely related to carbohydrate metabolism?": "Diabetes",
  "what is the main storage form of carbohydrates in animals?": "Glycogen",
  "what are carbohydrates composed of?": "Carbon, Hydrogen, Oxygen",
  "what type of carbohydrates are found in milk?": "Lactose",
  "which of the following is not a monosaccharide?": "Starch",
  "what happens when blood sugar is too high?": "Release of insulin",
  "which diet practice helps in weight management?": "Balancing carbohydrate intake",
  "what is the role of fiber in the diet?": "Aids in digestion",
  "which is a complex carbohydrate?": "Cellulose",
  "which polysaccharide cannot be digested by humans?": "Cellulose",
  "which sugar is found in fruits?": "Fructose",
  "which carbohydrate is a polymer of glucose?": "Cellulose",
  "which is a low GI carbohydrate?": "Oatmeal",
  "what is the role of insulin in the body?": "Facilitates glucose uptake",
  "which disaccharide is composed of glucose and fructose?": "Sucrose",
  "what is a primary role of carbohydrates in plants?": "Structural support",
  "which carbohydrate is stored in the liver?": "Glycogen",
  "what is lactose intolerance?": "Inability to metabolize lactose",
  "what is the primary carbohydrate in sports drinks?": "Glucose",
  "what type of sugar is table sugar?": "Sucrose",
  "which monosaccharide is mainly used for energy in the body?": "Glucose",
  "what season do many trees lose their leaves?": "Autumn",
  "which animal is known to hibernate during winter?": "Bear",
  "in which season do flowers usually start to bloom?": "Spring",
  "what do birds often do to survive cold winters?": "Migrate",
  "which season has the longest days and shortest nights?": "Summer",
  "how do animals like squirrels prepare for winter?": "Store food",
  "what happens to daylight hours during winter?": "Decrease",
  "which season is known for leaves changing color?": "Autumn",
  "what do some animals do to adapt to colder temperatures?": "Grow thicker fur",
  "in which season are baby animals like lambs often born?": "Spring",
  "why do some plants die back in winter?": "Cold temperatures",
  "what season is typically associated with harvesting crops?": "Autumn",
  "which season do animals like deer grow new antlers?": "Spring",
  "how do some insects survive the winter season?": "Build cocoons",
  "what changes in the environment signal birds to migrate?": "All of the above",
  "in which season do many animals shed their heavy winter coats?": "Spring",
  "what happens to many plants during spring?": "They bloom",
  "why do some animals change color with the seasons?": "To match the environment",
  "which season do animals like bears typically hibernate?": "Winter",
  "what do animals that migrate usually search for?": "Warmer climates",
  "how do plants like evergreens survive winter?": "Produce antifreeze substances",
  "in which season do leaves grow back on deciduous trees?": "Spring",
  "what do frogs do during winter to survive the cold?": "Burrow underground",
  "why do animals like rabbits grow white fur in winter?": "To hide in the snow",
  "which season do we usually see the most butterflies?": "Summer",
  "what is it called when plants stop growing during winter?": "Dormancy",
  "how do fish survive in ponds that freeze over in winter?": "Live in the water below ice",
  "which season has the shortest days and longest nights?": "Winter",
  "what do animals like geese form when migrating?": "V-shaped formations",
  "in which season do many animals have babies?": "Spring",
  "why do some trees lose their leaves in autumn?": "To conserve water",
  "how do bees survive during the winter?": "They stay warm in the hive",
  "what do animals like bears eat a lot before hibernation?": "Fat-rich foods",
  "which season do people often plant new seeds?": "Spring",
  "what happens to some animals' metabolism during hibernation?": "Slows down",
  "why do some animals migrate?": "To find food",
  "in which season do leaves turn red, orange, and yellow?": "Autumn",
  "what is the main reason animals hibernate?": "Lack of food",
  "how do earthworms survive when the ground freezes?": "They burrow deeper underground",
  "which season is known for being cold and snowy in many places?": "Winter",
  "what do animals like rabbits do to stay warm in winter?": "Build shelters",
  "in which season do farmers usually plant crops?": "Spring",
  "how does the change in seasons affect the amount of daylight?": "It changes throughout the year",
  "what do animals like hedgehogs do during cold seasons?": "Hibernate",
  "which molecule is essential for life and has a bent shape with polar covalent bonds?": "Water",
  "which characteristic describes molecular polarity?": "Uneven distribution of charge",
  "what type of bond forms between a hydrogen atom attached to an electronegative atom and another electronegative atom?": "Hydrogen bond",
  "which property of water allows water molecules to stick to each other?": "Cohesion",
  "what property of water allows it to stick to other surfaces?": "Adhesion",
  "which property causes the surface of water to act like a flexible skin?": "Surface tension",
  "what term describes a single subunit that can be bonded to form a polymer?": "Monomer",
  "what term refers to a large molecule made of repeating monomer units?": "Polymer",
  "which process involves breaking down polymers into monomers by adding water?": "Hydrolysis",
  "which reaction forms a covalent bond between monomers by removing water?": "Dehydration synthesis",
  "which term describes large biological molecules like proteins and nucleic acids?": "Macromolecule",
  "which macromolecule is composed of sugar monomers and functions in energy storage and structure?": "Carbohydrate",
  "which macromolecule is made of amino acid monomers and performs a variety of functions including catalysis?": "Protein",
  "which macromolecule carries genetic information in cells?": "Nucleic acid",
  "what is the monomer unit of proteins?": "Amino acid",
  "what is the monomer of nucleic acids?": "Nucleotide",
  "which type of bond links amino acids together in a protein?": "Peptide bond",
  "what type of bond involves the sharing of electron pairs between atoms?": "Covalent bond",
  "which component of a nucleotide contains phosphorus and oxygen atoms?": "Phosphate group",
  "what part of a nucleotide distinguishes one nucleotide from another?": "Nitrogenous base",
  "which sugar is found in the backbone of DNA?": "Deoxyribose",
  "which sugar is present in the backbone of RNA but not in DNA?": "Ribose",
  "which nitrogenous base pairs with adenine in DNA?": "Thymine",
  "which nitrogenous base is found in RNA but not in DNA?": "Uracil",
  "which nucleic acid typically exists as a double stranded molecule?": "DNA",
  "which nucleic acid is usually single stranded and can catalyze reactions?": "RNA",
  "what term describes the twisted ladder structure of DNA?": "Double helix",
  "which level of protein structure is determined by the sequence of amino acids?": "Primary structure",
  "which protein structure includes alpha-helices and beta-sheets formed by hydrogen bonding?": "Secondary structure",
  "which level of protein structure describes the overall three-dimensional shape of a single polypeptide chain?": "Tertiary structure",
  "which protein structure results from the association of multiple polypeptide subunits?": "Quaternary structure",
  "which part of an amino acid side chain determines its chemical properties?": "R group",
  "what term describes amino acid side chains that repel water?": "Hydrophobic",
  "what term describes amino acid side chains that interact well with water?": "Hydrophilic",
  "what type of R group gain or lose electrons and form charged side chains?": "Ionic",
  "which element is the primary building block of organic molecules?": "Carbon",
  "which element is essential for the formation of amino acids and nucleotides?": "Nitrogen",
  "which element is found in the phosphate group of nucleotides?": "Phosphorus",
  "which term describes fatty acids that contain one or more double bonds?": "Unsaturated",
  "which type of lipid has both hydrophilic and hydrophobic regions and forms cell membranes?": "Phospholipid",
  "which phrase describes the process by which monomers are connected to build polymers?": "Monomer assembly",
  "what are the smaller compounds called that join together to form polymers?": "Monomers",
  "what term is used for 'giant molecules' in biology?": "Macromolecules",
  "which elements are found in carbohydrates?": "Carbon, Hydrogen, Oxygen",
  "what is the chemical formula of monosaccharides?": "C6H12O6",
  "what is the chemical formula of disaccharides?": "C12H22O11",
  "which process joins two monosaccharides together with the release of one molecule of water?": "Dehydration Synthesis",
  "what reaction breaks down carbohydrates into their monomer units?": "Hydrolysis",
  "what are polysaccharides?": "Polymers of carbohydrates",
  "how are polysaccharides formed?": "By dehydration reactions",
  "what is the Glycemic Index (GI)?": "A measure of how quickly food raises blood sugar",
  "which foods do not have a GI?": "Meats",
  "why is GI important for diabetes management?": "It helps manage blood sugar levels",
  "what effect do low-GI foods have on blood sugar?": "They cause a gradual rise",
  "which of the following is not a type of lipid?": "Proteins",
  "why are lipids grouped together?": "Because they are all hydrophobic",
  "what are most lipids composed of?": "1 glycerol and 3 fatty acids",
  "what are the two varieties of fatty acids?": "Saturated and Unsaturated",
  "which of the following is a modified lipid?": "Phospholipids",
  "what is a characteristic of steroids?": "They consist of four fused rings",
  "how can consuming low-GI foods affect insulin sensitivity?": "It improves insulin sensitivity",
  "what is a common factor between lipids and low-GI foods in diabetes management?": "Both help in weight management",
  "what is the first step in testing for fat in a sample?": "Add ethanol",
  "what should you do after adding alcohol to a fat sample?": "Shake the test tube gently",
  "what indicates the presence of fat after the final step of the fat test?": "The solution turns milky white",
  "which of the following is a result of hydrolysis?": "Breaking down of polysaccharides",
  "dehydration synthesis involves the:": "Removal of water to form bonds",
  "what characteristic do all lipids share?": "They are hydrophobic",
  "which of the following is a lipid with a glycerol backbone?": "Triglyceride",
  "what is the primary difference between saturated and unsaturated fatty acids?": "Saturated fats are solid at room temperature, unsaturated fats are not",
  "which of the following statements is true regarding dehydration synthesis?": "It releases water as a byproduct",
  "what is the defining characteristic of a chemical compound?": "It consists of two or more elements chemically combined in definite proportions.",
  "which type of bond is formed when one or more electrons are transferred from one atom to another?": "Ionic bond",
  "a covalent bond is characterized by the...": "sharing of electrons between atoms.",
  "which of the following is described as a weak attraction between a hydrogen atom and an atom like oxygen or nitrogen?": "Hydrogen bond",
  "substances that have the same molecular formula but different structural arrangements of atoms are called:": "Isomers",
  "which subatomic particles are located in the nucleus of an atom?": "Protons and neutrons",
  "isotopes of the same element differ in their number of:": "Neutrons",
  "which of the following is a key characteristic of radioactive isotopes (radioisotopes)?": "They are unstable and release radiation as they break down.",
  "what defines a chemical element?": "The number of protons in its atoms' nuclei",
  "which three subatomic particles constitute an atom?": "Protons, neutrons, and electrons",
  "which of the following is a primary characteristic that classifies a diverse group of substances like fats, oils, and waxes as lipids?": "They are all hydrophobic, meaning they do not mix with water.",
  "the diagram illustrating the formation of a triglyceride shows one glycerol molecule reacting with three fatty acid molecules. What is this chemical process called?": "Dehydration Synthesis",
  "what is the key chemical feature of a saturated fatty acid chain?": "It has no double bonds between the carbon atoms.",
  "which of these food items is a common source of saturated fats?": "Fatty cuts of beef",
  "what does the Glycemic Index (GI) measure?": "How quickly a food containing carbohydrates raises blood sugar levels.",
  "which of the following food types do NOT have a Glycemic Index value?": "Oils, fats, and meats",
  "why is consuming low-GI foods beneficial for individuals with diabetes?": "They are absorbed slowly, leading to a gradual rise in blood sugar levels.",
  "how can a diet consisting of low-GI foods affect insulin sensitivity?": "It may improve insulin sensitivity over time.",
  "what is the primary reason that low-GI foods are recommended for managing diabetes?": "They help in avoiding sharp spikes and subsequent crashes in blood sugar levels.",
  "when iodine solution is added to the potato, a blue-black color appears. What does this color change indicate?": "A positive test for the presence of starch.",
  "what is the main function of cellulose in plants?": "It makes up the plant cell walls.",
  "which polysaccharide is described as \"animal starch\" and is stored in the liver and skeletal muscle of humans?": "Glycogen",
  "based on the provided table, which polysaccharide is structural and found in insects?": "Chitin",
  "which of the following food items would be a primary source of monosaccharides?": "Oranges",
  "what is the name of the process where two monosaccharides join together to form a disaccharide with the release of a water molecule?": "Dehydration synthesis",
  "what are the final products of carbohydrate digestion before they are absorbed into the bloodstream?": "Monosaccharides such as glucose, galactose, and fructose",
  "what are the three elements that make up carbohydrates?": "Carbon, Hydrogen, and Oxygen",
  "what is the general chemical formula for a monosaccharide?": "C6H12O6",
  "where does the initial digestion of dietary carbohydrates begin, and which enzyme is responsible?": "Mouth; Salivary α-amylase",
  "based on the image, which of the following substances has a lower concentration of H+ ions than tomato juice?": "Baking soda",
  "what pH value is considered completely neutral?": "7",
  "which of the following is an example of a basic (alkaline) substance?": "All of the above",
  "what is the primary function of a buffer?": "To resist sharp, sudden changes in pH.",
  "blood has a normal pH of 7.4 and is regulated by buffers. This means that blood is naturally:": "Slightly basic (alkaline)",
  "what is the term for the attraction between molecules of different substances?": "Adhesion",
  "the combined forces of cohesion and adhesion result in which of the following phenomena?": "Capillary action",
  "why is water referred to as the \"universal solvent\"?": "It is a highly polar molecule, allowing it to dissolve all polar and ionic substances.",
  "what is a mixture where the components are evenly distributed throughout?": "Solution",
  "which of the following describes a suspension?": "A mixture of water and non-dissolved material.",
  "in a water molecule (H2O), which of the following correctly describes the partial charges?": "The hydrogen atom has a partial positive charge, and the oxygen atom has a partial negative charge.",
  "which of the following best defines cohesion?": "The attraction of molecules of the same substance.",
  "in an experiment where water is poured along a soaked rope from one container to another, what property explains why the water follows the rope?": "Cohesion due to hydrogen bonding",
  "in a water molecule (H2O), what are the partial charges on the hydrogen and oxygen atoms?": "Hydrogen is partially positive, and oxygen is partially negative.",
  "the property of water molecules sticking to each other is known as cohesion. This is a direct result of:": "Hydrogen bonds",
  "why is ice less dense than liquid water?": ["The hydrogen bonds in the ice's crystal lattice structure hold the molecules farther apart than in liquid water.","The water molecules in ice form a crystal lattice with more space between them."],
  "water has a high heat capacity. This means:": "It can absorb a large amount of heat with only a small change in temperature.",
  "the 'beading' of water on a waxy surface is primarily caused by which property?": "The cohesive forces of water are stronger than the adhesive forces between water and wax.",
  "an atom's structure consists of specific subatomic particles. Which statement accurately describes the location and charge of these components?": "The nucleus has positive protons and neutral neutrons. Negative electrons orbit this central core.",
  "two atoms of the same element have the same number of protons but a different number of neutrons, resulting in different atomic masses. What are these atoms called?": "They are called isotopes, atoms of the same element that differ only in their number of neutrons in the nucleus.",
  "a chemical bond forms when one atom completely transfers one or more electrons to another atom, creating oppositely charged ions that attract. What is this bond called?": "An ionic bond, which results from the electrostatic attraction between positively and negatively charged ions.",
  "the polarity of water molecules causes them to attract each other. What is this weak attraction between a positive hydrogen and a negative oxygen atom of another molecule?": "Hydrogen bond, a weak attraction between the slightly positive hydrogen of one molecule and the oxygen of another.",
  "nonpolar substances like oil do not mix with polar substances like water because they are repelled by water molecules. What term describes this \"water-hating\" property?": "Hydrophobic, a \"water-hating\" property of nonpolar substances that do not dissolve in water.",
  "consuming saturated fats in excess can lead to which of the following health issues?": "plaque buildup in arteries",
  "which of the following is listed as a primary health benefit of consuming unsaturated fats?": "They help reduce inflammation and support brain health.",
  "which of these food items is a primary source of saturated fat?": "Butter",
  "what is the direct health outcome of replacing saturated fats with unsaturated fats in one's diet?": "A reduced risk of heart disease",
  "what is the essential function of phospholipids in the body?": "They form the structural bilayer of cell membranes.",
  "proteins (蛋⽩质) are polymers. What are the individual units, or monomers, that are joined together by peptide bonds (肽键) to form these polymers?": "Amino Acids (氨基酸)",
  "hormones like insulin and adrenaline transmit signals between cells to coordinate bodily processes. To which functional class of proteins do they belong?": "Messenger Proteins",
  "collagen step of the fat test?": "The solution turns milky white",
  "which of the following is a result of hydrolysis?": "Breaking down of polysaccharides",
  "dehydration synthesis involves the:": "Removal of water to form bonds",
  "what characteristic do all lipids share?": "They are hydrophobic",
  "which of the following is a lipid with a glycerol backbone?": "Triglyceride",
  "what is the primary difference between saturated and unsaturated fatty acids?": "Saturated fats are solid at room temperature, unsaturated fats are not",
  "which of the following statements is true regarding dehydration synthesis?": "It releases water as a byproduct",
  "what is the defining characteristic of a chemical compound?": "It consists of two or more elements chemically combined in definite proportions.",
  "which type of bond is formed when one or more electrons are transferred from one atom to another?": "Ionic bond",
  "a covalent bond is characterized by the...": "sharing of electrons between atoms.",
  "which of the following is described as a weak attraction between a hydrogen atom and an atom like oxygen or nitrogen?": "Hydrogen bond",
  "substances that have the same molecular formula but different structural arrangements of atoms are called:": "Isomers",
  "which subatomic particles are located in the nucleus of an atom?": "Protons and neutrons",
  "isotopes of the same element differ in their number of:": "Neutrons",
  "which of the following is a key characteristic of radioactive isotopes (radioisotopes)?": "They are unstable and release radiation as they break down.",
  "what defines a chemical element?": "The number of protons in its atoms' nuclei",
  "which three subatomic particles constitute an atom?": "Protons, neutrons, and electrons",
  "which of the following is a primary characteristic that classifies a diverse group of substances like fats, oils, and waxes as lipids?": "They are all hydrophobic, meaning they do not mix with water.",
  "the diagram illustrating the formation of a triglyceride shows one glycerol molecule reacting with three fatty acid molecules. What is this chemical process called?": "Dehydration Synthesis",
  "what is the key chemical feature of a saturated fatty acid chain?": "It has no double bonds between the carbon atoms.",
  "which of these food items is a common source of saturated fats?": "Fatty cuts of beef",
  "what does the Glycemic Index (GI) measure?": "How quickly a food containing carbohydrates raises blood sugar levels.",
  "which of the following food types do NOT have a Glycemic Index value?": "Oils, fats, and meats",
  "why is consuming low-GI foods beneficial for individuals with diabetes?": "They are absorbed slowly, leading to a gradual rise in blood sugar levels.",
  "how can a diet consisting of low-GI foods affect insulin sensitivity?": "It may improve insulin sensitivity over time.",
  "what is the primary reason that low-GI foods are recommended for managing diabetes?": "They help in avoiding sharp spikes and subsequent crashes in blood sugar levels.",
  "when iodine solution is added to the potato, a blue-black color appears. What does this color change indicate?": "A positive test for the presence of starch.",
  "what is the main function of cellulose in plants?": "It makes up the plant cell walls.",
  "which polysaccharide is described as \"animal starch\" and is stored in the liver and skeletal muscle of humans?": "Glycogen",
  "based on the provided table, which polysaccharide is structural and found in insects?": "Chitin",
  "which of the following food items would be a primary source of monosaccharides?": "Oranges",
  "what is the name of the process where two monosaccharides join together to form a disaccharide with the release of a water molecule?": "Dehydration synthesis",
  "what are the final products of carbohydrate digestion before they are absorbed into the bloodstream?": "Monosaccharides such as glucose, galactose, and fructose",
  "what are the three elements that make up carbohydrates?": "Carbon, Hydrogen, and Oxygen",
  "what is the general chemical formula for a monosaccharide?": "C6H12O6",
  "where does the initial digestion of dietary carbohydrates begin, and which enzyme is responsible?": "Mouth; Salivary α-amylase",
  "based on the image, which of the following substances has a lower concentration of H+ ions than tomato juice?": "Baking soda",
  "what pH value is considered completely neutral?": "7",
  "which of the following is an example of a basic (alkaline) substance?": "All of the above",
  "what is the primary function of a buffer?": "To resist sharp, sudden changes in pH.",
  "blood has a normal pH of 7.4 and is regulated by buffers. This means that blood is naturally:": "Slightly basic (alkaline)",
  "what is the term for the attraction between molecules of different substances?": "Adhesion",
  "the combined forces of cohesion and adhesion result in which of the following phenomena?": "Capillary action",
  "why is water referred to as the \"universal solvent\"?": "It is a highly polar molecule, allowing it to dissolve all polar and ionic substances.",
  "what is a mixture where the components are evenly distributed throughout?": "Solution",
  "which of the following describes a suspension?": "A mixture of water and non-dissolved material.",
  "in a water molecule (H2O), which of the following correctly describes the partial charges?": "The hydrogen atom has a partial positive charge, and the oxygen atom has a partial negative charge.",
  "which of the following best defines cohesion?": "The attraction of molecules of the same substance.",
  "in an experiment where water is poured along a soaked rope from one container to another, what property explains why the water follows the rope?": "Cohesion due to hydrogen bonding",
  "in a water molecule (H2O), what are the partial charges on the hydrogen and oxygen atoms?": "Hydrogen is partially positive, and oxygen is partially negative.",
  "the property of water molecules sticking to each other is known as cohesion. This is a direct result of:": "Hydrogen bonds",
  "why is ice less dense than liquid water?": ["The hydrogen bonds in the ice's crystal lattice structure hold the molecules farther apart than in liquid water.","The water molecules in ice form a crystal lattice with more space between them."],
  "water has a high heat capacity. This means:": "It can absorb a large amount of heat with only a small change in temperature.",
  "the 'beading' of water on a waxy surface is primarily caused by which property?": "The cohesive forces of water are stronger than the adhesive forces between water and wax.",
  "an atom's structure consists of specific subatomic particles. Which statement accurately describes the location and charge of these components?": "The nucleus has positive protons and neutral neutrons. Negative electrons orbit this central core.",
  "two atoms of the same element have the same number of protons but a different number of neutrons, resulting in different atomic masses. What are these atoms called?": "They are called isotopes, atoms of the same element that differ only in their number of neutrons in the nucleus.",
  "a chemical bond forms when one atom completely transfers one or more electrons to another atom, creating oppositely charged ions that attract. What is this bond called?": "An ionic bond, which results from the electrostatic attraction between positively and negatively charged ions.",
  "the polarity of water molecules causes them to attract each other. What is this weak attraction between a positive hydrogen and a negative oxygen atom of another molecule?": "Hydrogen bond, a weak attraction between the slightly positive hydrogen of one molecule and the oxygen of another.",
  "nonpolar substances like oil do not mix with polar substances like water because they are repelled by water molecules. What term describes this \"water-hating\" property?": "Hydrophobic, a \"water-hating\" property of nonpolar substances that do not dissolve in water.",
  "consuming saturated fats in excess can lead to which of the following health issues?": "plaque buildup in arteries",
  "which of the following is listed as a primary health benefit of consuming unsaturated fats?": "They help reduce inflammation and support brain health.",
  "which of these food items is a primary source of saturated fat?": "Butter",
  "what is the direct health outcome of replacing saturated fats with unsaturated fats in one's diet?": "A reduced risk of heart disease",
  "what is the essential function of phospholipids in the body?": "They form the structural bilayer of cell membranes.",
  "proteins (蛋⽩质) are polymers. What are the individual units, or monomers, that are joined together by peptide bonds (肽键) to form these polymers?": "Amino Acids (氨基酸)",
  "hormones like insulin and adrenaline transmit signals between cells to coordinate bodily processes. To which functional class of proteins do they belong?": "Messenger Proteins",
  "collagen, found in muscles and bones, and keratin, which forms hair and skin, are examples of which type of protein?": "Structural Proteins",
  "which of the following best describes the function of defensive proteins, such as antibodies?": "They identify and neutralize harmful invaders like bacteria and viruses.",
  "hemoglobin is a protein that carries oxygen in the blood, and ferritin is a protein that stores iron. These proteins are classified as:": "Transport and Storage Proteins",
  "what is the correct and safest way to carry a microscope?": "With one hand on the arm and one hand under the base.",
  "which part of the microscope is used for the initial, rough focusing of the specimen?": "The Coarse Focus Knob",
  "before you place your slide on the stage, which objective lens should be clicked into position?": "The lowest power objective.",
  "when viewing a specimen under the high-power objective, which knob should you NEVER use?": "The Coarse Focus Knob",
  "what is the final step listed in the cleanup procedure after you have finished your observation?": "Switch to the lowest power objective, remove the slide, turn off the light, and unplug the scope.",
  "what defines an \"essential amino acid\"?": "An amino acid that the body cannot produce, so it must be obtained from food.",
  "which of the following amino acids is classified as non-essential?": "Aspartate (Aspartic Acid)",
  "under what conditions do \"conditionally essential\" amino acids become essential?": "During times of significant stress, illness, or injury.",
  "a food that contains all nine essential amino acids is known as a \"complete protein.\" Which of the following plant-based foods is listed as a complete protein source?": "Quinoa",
  "all of the following are mentioned as excellent sources of animal-based complete proteins EXCEPT:": "Spirulina",
  "what level of protein structure is defined by the unique linear sequence of amino acids, such as the repeating glycine and alanine units in the MaSp1 spidroin?": "Primary structure",
  "the intricate, overall three-dimensional shape of a single polypeptide chain, such as one folded fibroin molecule, is known as its:": "Tertiary structure",
  "protein denaturation involves the loss of a protein's three-dimensional structure and biological function. Which level of protein structure remains intact during this process?": "Primary structure",
  "which of the following is a cause of protein denaturation that works by disrupting hydrogen bonds and hydrophobic interactions?": "High temperature",
  "what is the advance in technology leading to The Discovery of the Cell?": "the invention of the microscope",
  "what kind material Robert Hook is using?": "cork",
  "hooke called the chambers under microscope _______": "cells",
  "what Anton van Leeuwenhoek was studying?": "pond water",
  "in the Cell theory, Matthias Schleiden concluded that_______": "all plants are made of cells",
  "microscopes work by using____________ to produce magniﬁed images.": "beams of light or electrons",
  "a typical light microscope allows light to pass through a _________ and uses two lenses to form an image.": "specimen",
  "light microscopes can produce clear images of objects only to a magniﬁcation of about ________ times.": "1000",
  "since most living cells are nearly transparent, ______________ are used to help make cells and their parts visible.": "chemical stains or dyes",
  "light microscopes can be used to see cells and cell structures as small as 1 _______ of a meter": "millionth",
  "to study a virus or a DNA molecule, scientists need": "electron microscopes",
  "electron microscopes offer much _______ resolution than light microscopes.": "higher",
  "samples must be placed in a ______ to be studied with an electron microscope.": "vacuum",
  "electron microscopy, despite its higher resolution, can be used to examine only ___________ cells and tissues.": "nonliving",
  "the two major types of electron microscopes are ____________________________": "transmission and scanning",
  "in Transmission Electron Microscopes, Beams ams of electrons can only __________ thin samples, so cells and tissues must be cut into extremely thin slices before they can be examined.": "pass through",
  "in Scanning Electron Microscopes, a pencil like beam of electrons is ___________ the surface of a specimen.": "scanned over",
  "the colors in light micrographs come from the cells themselves or from _____________ used to highlight them.": "the stains and dyes",
  "electron micrographs, however, are actually ___________ color .": "black and white",
  "if scientists were studying a structure found on the surface of yeast, which kind of microscope would they likely use?": "Scanning Electron Microscopes",
  "typical cells range from _________ micrometers (um) in diameter.": "5 to 50",
  "all cells, at some point in their lives, contain ____________": "DNA",
  "all cells are surrounded by a thin ﬂexible barrier called a ___________________.": "cell membrane",
  "the ____________________ is a large membrane-enclosed structure that contains genetic material in the form of DNA.": "nucleus",
  "_________________________ are cells that enclose their DNA in nuclei.": "Eukaryotes",
  "________________________ are cells that do not enclose DNA in nuclei.": "prokaryotes",
  "the very ﬁrst photosynthetic organisms to appear on Earth, nearly 3 billion years ago, were _____________________": "cyanobacteria",
  "in eukaryotic cells, the _______________ separates the genetic material from the rest of the cell.": "nucleus",
  "in __________________, cells are specialized for speciﬁc tasks, such as support, communication, movement, or the production of proteins or other cell products.": "multicellular organisms",
  "as a general rule, the cells of multi-cellular organisms__________________________. They work together to complete the tasks of life.": "cannot survive individually",
  "eukaryotic organisms include ____________________ and many unicellular organisms.": "plants, animals, fungi",
  "the cell theory states:": "All living things are made up of cells; Cells are the basic units of structure and function in living things; New cells are produced from existing cells.",
  "german physician rudolfvirchow published the idea that_________________": "new cells can be produced only from the division of existing cells.",
  "in the cell theory theodor schwann stated that____________": "all animals are made of cells.",
  "the scanning electron microscope produces stunning ______________ images of the specimen's surface.": "three-dimensional",
  "the main objective of this experiment is to observe paramecia behavior in response to": "food and barriers",
  "what tool is essential for viewing paramecia behavior": "compound microscope",
  "what is the function of diluted glycerol solution in the experiment": "slows down paramecia",
  "what concentration of glycerol is recommended": ["1–2%"],
  "why should glycerol concentration not exceed 2%": "it harms paramecia",
  "what alternative to glycerol can slow paramecia temporarily": "cooling the slide",
  "the cooling method works best for": ["about 1–2 minutes"],
  "what happens if the slide is overcooled": "paramecia stop moving",
  "what should be avoided when placing the cover slip": "air bubbles",
  "what is the approximate size of a paramecium": "200–300 µm",
  "what structure helps paramecia move": "cilia",
  "which structure in paramecium pulsates every 10-20 seconds": "contractile vacuole",
  "the typical shape of a paramecium is": "slipper or oval",
  "paramecia move in": "spiral/curvilinear paths",
  "paramecia sometimes pause or reverse direction due to": "encountering obstacles",
  "in experiment step 3 what is used as a food source": "yeast suspension",
  "why is the barrier introduced in the experiment": "to test response to obstacles",
  "what behavior shows positive response to food": "clustering near food",
  "time taken for paramecia to reach food across barrier is usually": "60–150 s",
  "some paramecia cross barriers by": "passing through gaps",
  "the oral groove of paramecium functions in": "feeding",
  "the contractile vacuole helps in": "osmoregulation",
  "paramecia show what type of phototaxis": "negative",
  "increasing glycerol concentration affects": "contractile vacuole cycle time",
  "when paramecia stop moving the likely cause is": "overcooling",
  "for best results where should yeast drop be placed": "edge of cover slip",
  "what ensures reliable gradients during food tests": "keeping yeast separate at edge",
  "students should support observations with": "sketches or videos",
  "which organelle is responsible for modifying sorting and packaging proteins for secretion or delivery": "golgi apparatus",
  "which structure is the site of protein synthesis in the cell": "ribosome",
  "which organelle is studded with ribosomes on its surface and is involved in protein synthesis": "rough er",
  "what function is primarily associated with the smooth er in liver cells": "detoxification",
  "which er function is essential for producing fats and steroids": "lipid synthesis",
  "what term describes the process of directing proteins to specific destinations within or outside the cell": "protein trafficking",
  "which organelle is known as the powerhouse of the cell": "mitochondria",
  "which organelle contains hydrolytic enzymes for intracellular digestion": "lysosome",
  "which structure in plant cells stores water and maintains turgor pressure": "vacuole",
  "in which organelle does photosynthesis occur": "chloroplast",
  "which molecule has hydrophilic heads and hydrophobic tails in cell membranes": "phospholipid",
  "which term describes a molecule that is attracted to water": ["water-loving.","hydrophilic"],
  "which term describes a molecule that repels water and is nonpolar": ["water-hating","hydrophobic"],
  "which proteins facilitate the passive transport of ions through membranes": "channel proteins",
  "what term describes proteins that move substances across a membrane": "transport proteins",
  "what steroid molecule is found in animal cell membranes to regulate fluidity": "cholesterol",
  "which structure provides rigidity and protection to plant cells": "cell wall",
  "what term describes movement of molecules down their concentration gradient without energy input": "passive transport",
  "which process moves molecules against their concentration gradient using energy": "active transport",
  "what process allows cells to take in large molecules by forming vesicles from the plasma membrane": "endocytosis",
  "which process secretes large molecules by fusing vesicles with the plasma membrane": "exocytosis",
  "which type of transport uses proteins to assist movement of molecules down their concentration gradient": "facilitated diffusion",
  "which protein channel specifically facilitates water movement across cell membranes": "aquaporin",
  "which enzyme pumps sodium and potassium ions across the membrane using atp": "na+/k+ atpase",
  "which type of cell lacks membrane bound organelles and a nucleus": "prokaryote",
  "which type of cell contains membrane bound organelles and a true nucleus": "eukaryote",
  "what term describes cellular structures like the nucleus and mitochondria that have their own lipid bilayer": "membrane-bound organelles",
  "what property allows cell membranes to control which substances enter and exit the cell": "selective permeability",
  "which process describes the diffusion of water across a selectively permeable membrane": "osmosis",
  "what is the fundamental principle of diffusion": "movement of particles from a high concentration area to a low concentration area",
  "which of these is an everyday life example of diffusion given in the text": "the smell of perfume spreading through a room",
  "what is the biological example of diffusion mentioned in the class": "oxygen moving from the lungs into the blood",
  "why does exercise improve gas exchange": "it maintains a steep diffusion gradient for o2 and co2",
  "does the process of diffusion require the cell to expend energy (atp)": "no, it is a passive process",
  "what is the result of diffusion": "balance is reached (equilibrium)",
  "what is osmosis specifically defined as": "the movement of water through a semipermeable membrane",
  "in osmosis, water moves from a region of _____ solute concentration to a region of _____ solute concentration": "low, high",
  "what happens to cucumber slices placed in salt water": "they shrivel because water moves out of their cells",
  "why does salting meat or fish act as a preservative": "bacteria on the meat lose water by osmosis and die",
  "why is it dangerous to drink seawater": "it is hypertonic and will cause cells to lose water (dehydration)",
  "why is pure water not injected into the bloodstream": "it is hypotonic, causing blood cells to swell and burst",
  "medical solutions like saline are described as isotonic to prevent damage to blood cells": "isotonic",
  "what is the purpose of oral rehydration fluids salts": "to restore osmotic equilibrium after dehydration",
  "does the process of osmosis require the cell to expend energy (ATP)?": "no, it is a passive process",
  "what does facilitated diffusion require that simple diffusion does not": "carrier proteins or channels",
  "which substance is given as an example in the class that enters cells by facilitated diffusion": "glucose",
  "does facilitated diffusion require energy (ATP) from the cell?": "no, it does not",
  "how does diabetes connect to facilitated diffusion": "without insulin, glucose cannot efficiently enter cells by facilitated diffusion",
  "when does glucose primarily enter body cells via facilitated diffusion": "after eating carbohydrates",
  "what is the defining feature of active transport": "it requires energy (atp) to move substances against their gradient",
  "what biological example of active transport is given in the class?": "the sodium-potassium pump in nerve cells",
  "what is the function of the sodium potassium pump": "to maintain electrical balance for nerve function",
  "where in the body is an example of active transport absorbing nutrients": "small intestine",
  "why is a constant energy supply crucial for cells according to the text": "because active transport fails without energy",
  "what happens to a cells life functions if active transport fails eg due to oxygen deprivation": "the cell can no longer maintain them",
  "what form of energy is explicitly mentioned as being required for active transport": "atp",
  "what do cells use to move very large molecules or particles across the membrane": "vesicles",
  "what is the process called when white blood cells engulf bacteria": "endocytosis",
  "what is the process called when pancreatic cells release insulin": "exocytosis",
  "do endocytosis and exocytosis require energy": "yes, they require energy",
  "which process is a biological example of exocytosis": "pancreatic cells releasing insulin",
  "which process is a biological example of endocytosis": "white blood cells engulfing bacteria",
  "which of these transport types requires energy": "active transport",
  "which of these transport types does not require energy": "osmosis",
  "the cell can be divided into two major parts the nucleus and cytoplasm": "cytoplasm",
  "because many of structures inside cell act like specialized organs they are known as little organs": "organelles",
  "the contains nearly all the cells dna": "nucleus",
  "which carry the cells genetic information are also found in the nucleus": "chromosomes",
  "proteins are assembled on": "ribosomes",
  "the portion of the er involved in the synthesis of proteins is called rough endoplasmic reticulum or rough er": "endoplasmic reticulum",
  "break down lipids carbohydrates and proteins into small molecules that can be used by the rest of the cell": "lysosomes",
  "eukaryotic cells are given their shape and internal organization by a network of protein filaments known as the cytoskeleton": "cytoskeleton",
  "are the biological equivalents of solar power plants": "chloroplasts",
  "chloroplasts capture the energy from sunlight and convert it into chemical energy stored in food during photosynthesis": "photosynthesis",
  "mitochondria convert the chemical energy stored in food molecules into atp": "atp",
  "all cells contain cell membranes generally made up of a double layered sheet called a lipid bilayer": "lipid bilayer",
  "nearly all cell membranes are made up of a lipid bilayer in which proteins and carbohydrates are embedded": "proteins",
  "hydrophobic is": "water-hating",
  "hydrophilic is ____________": "water-loving.",
  "most cell membranes are selectively permeable meaning that some substances can pass across them and others cannot": "selectively permeable",
  "selectively permeable membranes are also called semipermeable membranes": "semipermeable membranes",
  "since most living cells are nearly transparent chemical stains or dyes are used to help make cells and their parts visible": "chemical stains or dyes",
  "electron microscopy despite its higher resolution can be used to examine only nonliving cells and tissues": "nonliving",
  "all cells are surrounded by a thin flexible barrier called a cell membrane": "cell membrane",
  "the is a large membrane enclosed structure that contains genetic material in the form of dna": "nucleus",
  "are cells that enclose their dna in nuclei": "eukaryotes",
  "are cells that do not enclose dna in nuclei": "prokaryotes",
  "the very first photosynthetic organisms to appear on earth nearly 3 billion years ago were cyanobacteria": "cyanobacteria",
  "eukaryotic organisms include plants animals fungi and many unicellular organisms": "plants animals fungi",
  "in eukaryotic cells the separates the genetic material from the rest of the cell": "nucleus",
  "in cells are specialized for specific tasks such as support communication movement or the production of proteins or other cell products": "multicellular organisms",
  "is a state of relatively constant internal physical and chemical condition": "homeostasis",
  "the process by which particles move from an area of higher concentration to an area of lower concentration is know as diffusion": "diffusion",
  "the movement of molecules across the cell membrane without using cellular energy is called passive transport": "passive transport",
  "in molecules that cannot directly diffuse across the membrane pass through special protein channels": "facilitated diffusion",
  "proteins in the cell membrane act as carriers or channels making it easy for certain molecules to cross": "channels",
  "many cells contain water channel proteins known as aquaporins that allow water to pass right through them": "aquaporins",
  "is the diffusion of water through a selectively permeable membrane": "osmosis",
  "_______________ = above strength,": "hypertonic",
  "______________ = below strength.": "hypotonic",
  "the movement of materials against a concentration difference is known as active transport and it requires energy": "active transport",
  "is the process of taking material into the cell by means of infoldings or pockets of the cell membrane": "endocytosis",
  "many cells also release large amounts of material a process known as exocytosis": "exocytosis",
  "during exocytosis the membrane of the surrounding the material fuses with the cell membrane forcing the contents out of the cell": "vesicle or vacuole",
  "the golgi apparatus _______________ proteins and other materials.": "modiﬁes, sorts, and packages",
  "who was the first person to use the term \"cell\" in a biological context?": "Robert Hooke",
  "what did anton van leeuwenhoek observe in pond water and his own mouth?": "Tiny living organisms",
  "which scientist concluded that all plants are made of cells?": "Matthias Schleiden",
  "which concept states that new cells are produced from existing cells?": "The cell theory",
  "according to the text, what is the fundamental principle of how microscopes work?": "They use beams of light or electrons to produce magnified images.",
  "in a compound light microscope, what is the function of the objective lens?": "It enlarges the image of the specimen.",
  "what is a primary limitation of light microscopes mentioned in the text?": "They are limited to a magnification of about 1000 times.",
  "why are chemical stains or dyes used with light microscopes?": "To make the nearly transparent cells visible.",
  "which type of microscope uses beams of electrons instead of light?": "Electron microscope",
  "what is a major disadvantage of using electron microscopes?": "They can only be used to examine nonliving cells and tissues.",
  "which microscope produces stunning three-dimensional images of a specimen's surface?": "Scanning electron microscope (SEM)",
  "what is the source of color in electron micrographs?": "\"False color\" added by computer techniques.",
  "all cells are surrounded by a thin, flexible barrier called the...": "cell membrane",
  "what is the defining characteristic that separates eukaryotes from prokaryotes?": "Eukaryotes enclose their DNA in a nucleus, while prokaryotes do not.",
  "which of the following is given as an example of a prokaryote?": "Bacteria",
  "what did robert hooke observe that led him to name the structures \"cells\"?": "Tiny empty chambers in a slice of cork.",
  "the discoveries of schleiden, schwann, and virchow are summarized in what fundamental concept of biology?": "The cell theory",
  "what technology uses dyes that give off light to label specific molecules within a cell?": "Fluorescence microscopy",
  "which type of microscope would likely be used to explore internal cell structures and large protein molecules by passing electrons through a very thin slice of the specimen?": "Transmission electron microscope (TEM)",
  "according to the text, what two features are common to all cells at some point in their lives?": "A cell membrane and DNA",
  "a nucleus is a large, membrane-enclosed structure that contains...": "the cell's genetic material (DNA)",
  "eukaryotes are organisms whose cells...": "enclose their DNA in nuclei.",
  "which of the following is not an example of a eukaryote?": "Cyanobacteria",
  "what is the smallest living unit of any organism?": "A cell",
  "the invention of what instrument made the discovery of the cell possible?": "The microscope",
  "what did german botanist matthias schleiden conclude in 1838?": "All plants are made of cells.",
  "what is a photo of an object seen through a microscope called?": "A micrograph",
  "according to figure 8-4, which of the following can be seen with the unaided human eye?": "Chicken egg",
  "in a prokaryotic cell, where is the genetic material located?": "Freely within the cell, not enclosed in a nucleus",
  "what does the text say about the cells of multicellular organisms?": "They are specialized for specific tasks.",
  "what is the another name for the cell membrane mentioned in the text?": "Plasma membrane",
  "what property of light waves causes them to be scattered as they pass through matter, limiting microscope resolution?": "Diffraction",
  "why must samples be placed in a vacuum for electron microscopy?": "Because electrons are easily scattered by molecules in the air.",
  "who stated that all animals are made of cells?": "Theodor Schwann",
  "according to the text, what is a typical size range for cells?": "5 to 50 micrometers",
  "the molecule that carries biological information in all cells is...": "DNA",
  "which organisms released oxygen into the atmosphere, making plant and animal life possible?": "Cyanobacteria",
  "the second lens in a light microscope, which magnifies the image further, is called the...": "ocular lens",
  "to study a structure on the surface of a cell, which microscope would be the most suitable choice?": "Scanning electron microscope (SEM)",
  "how do prokaryotic cells compare to eukaryotic cells in general?": "They are generally smaller and simpler.",
  "the term \"transmission\" in transmission electron microscopy implies that...": "a beam of electrons is sent through a thin sample.",
  "what is one of the three main points of the cell theory listed in the text?": "Cells are the basic units of structure and function in living things.",
  "Unit 3": "3",
  "which enzyme breaks down starch in the mouth ?": "Amylase",
  "what is the product of starch digestion ?": "Maltose",
  "which enzyme digests proteins in the stomach ?": "Pepsin",
  "what is the approximate ph of the stomach ?": "2",
  "which enzyme digests fat ?": "Lipase",
  "where does fat digestion mainly occur ?": "Small intestine",
  "which enzyme breaks lactose into simple sugars ?": "Lactase",
  "which enzyme breaks sucrose into glucose and fructose ?": "Sucrase",
  "where are lactase and sucrase found ?": "Brush border of small intestine",
  "lack of amylase affects digestion of which nutrient ?": "Carbohydrates",
  "pepsinogen deficiency affects digestion of which nutrient ?": "Proteins",
  "pancreatic insufficiency leads to poor absorption of which nutrient ?": "Fats",
  "what causes lactose intolerance ?": "Lactase deficiency",
  "sucrase deficiency causes which symptom ?": "Chronic diarrhea",
  "malabsorption of which nutrient causes oily stools ?": "Fat",
  "which organs secrete most digestive enzymes ?": "Pancreas and glands",
  "what ensures efficient nutrient absorption ?": "Digestive enzymes",
  "what happens when lactase is missing ?": "Gas and diarrhea after milk",
  "where does carbohydrate digestion begin ?": "Mouth",
  "what is the main role of digestive enzymes ?": "Break macromolecules into smaller units",
  "what is the purpose of cellular respiration ?": "Produce ATP",
  "what are the reactants of cellular respiration ?": "Glucose and oxygen",
  "what are the products of cellular respiration ?": "CO₂, H₂O and ATP",
  "where does cellular respiration occur ?": "Mitochondria",
  "mitochondrial disease reduces production of what ?": "ATP",
  "which reaction in skin produces vitamin d ?": "Photosensitive reaction",
  "why is vitamin d important ?": "Helps calcium absorption",
  "what gas does hemoglobin carry ?": "Oxygen",
  "what prevents oxygen binding to hemoglobin ?": "Carbon monoxide",
  "what is the purpose of the urea cycle ?": "Detoxify ammonia",
  "which enzyme is part of the urea cycle ?": "Carbamoyl phosphate synthetase",
  "how is urea removed from the body ?": "By kidneys",
  "what causes hemophilia ?": "Lack of clotting factors",
  "which enzyme converts fibrinogen to fibrin ?": "Thrombin",
  "which enzyme replicates dna ?": "DNA polymerase",
  "what is the purpose of dna replication ?": "Pass genetic information to new cells",
  "which enzyme breaks down acetylcholine ?": "Acetylcholinesterase",
  "myasthenia gravis affects which system ?": "Nervous system",
  "what does atp hydrolysis release ?": "Energy",
  "which enzyme powers muscle contraction ?": "Myosin ATPase",
  "what does atp stand for ?": "Adenosine triphosphate",
  "how many phosphate groups does adp have ?": "Two",
  "how do cells store energy ?": "By adding phosphate to ADP",
  "how does atp release energy ?": "By breaking phosphate bonds",
  "why is atp not used for long-term storage ?": "It is unstable and short-lived",
  "how does the energy in glucose compare to atp ?": "Glucose stores about 90 times more",
  "what process converts sunlight into food molecules ?": "Photosynthesis",
  "what does “photosynthesis” mean ?": "Using light to put together",
  "organisms that make their own food are called ?": "Autotrophs",
  "organisms that eat other living things are called ?": "Heterotrophs",
  "what is the process that changes one set of compounds into another ?": "Chemical reaction",
  "what are the substances that enter a chemical reaction ?": "Reactants",
  "what are the substances formed as a result of a chemical reaction ?": "Products",
  "what principle is conserved during chemical reactions ?": "Mass and energy",
  "which reaction occurs slowly in nature ?": "Rusting of iron",
  "what happens when chemical bonds are formed or broken ?": "Energy is released or absorbed",
  "what type of reaction releases energy ?": "Exothermic reaction",
  "what type of reaction requires an external energy source ?": "Endothermic reaction",
  "what happens in the reaction of hydrogen and oxygen to form water ?": "Energy is released",
  "which process requires electrical energy to occur ?": "Splitting water",
  "why do organisms need energy ?": "To carry out life processes",
  "what is the main energy source for plants ?": "Sunlight",
  "how do animals obtain energy ?": "By eating and digesting food",
  "what is the energy required to start a chemical reaction called ?": "Activation energy",
  "what provides activation energy for paper to burn ?": "Flame",
  "why don’t all energy-releasing reactions occur spontaneously ?": "They need activation energy",
  "what determines whether a chemical reaction will occur ?": "Energy changes",
  "what is released when hydrogen burns in oxygen ?": "Heat and light energy",
  "what is the process of converting water into hydrogen and oxygen called ?": "Electrolysis",
  "what is the energy needed to start any reaction ?": "Activation energy",
  "what is a catalyst ?": "A substance that speeds up a reaction",
  "what are enzymes ?": "Biological catalysts made of proteins",
  "what is the main function of an enzyme ?": "To lower activation energy",
  "why are enzymes required for life ?": "Many reactions are too slow without them",
  "most enzyme names end with which suffix ?": "-ase",
  "what does carbonic anhydrase do ?": "Speeds up CO₂ + H₂O → H₂CO₃",
  "how much faster can carbonic anhydrase make its reaction ?": "10 million times",
  "why are enzymes specific ?": "Each catalyzes one specific reaction",
  "what are the reactants in enzyme-catalyzed reactions called ?": "Substrates",
  "where do substrates bind on an enzyme ?": "Active site",
  "what forms when a substrate binds to an enzyme ?": "Enzyme-substrate complex",
  "what happens to enzymes after a reaction ?": "They are reused",
  "what effect does lowering activation energy have ?": "Increases reaction speed",
  "how are enzymes named ?": "After the reaction they catalyze",
  "at what temperature do most enzymes work best ?": "Body temperature",
  "what happens to enzymes at very high temperatures ?": "They denature",
  "what factors affect enzyme activity ?": "pH and temperature",
  "what happens when ph is far from optimal ?": "Enzyme activity decreases",
  "what type of biomolecule are enzymes ?": "Proteins",
  "what must reactants do for a reaction to occur ?": "Collide with enough energy",
  "6666":"NB",
  "what are the light-absorbing compounds that photosynthetic organisms use to capture sunlight energy?": "Pigments",
  "what is the principal pigment found in green plants?": "Chlorophyll",
  "in what regions of the visible spectrum do chlorophyll a and chlorophyll b absorb light very well?": "Blue-violet and red",
  "what color of light does chlorophyll reflect, making leaves appear green?": "Green",
  "what is the primary role of pigments in photosynthesis?": "To capture energy from sunlight",
  "what are accessory pigments, like carotene, responsible for?": "Absorbing light in other regions of the spectrum",
  "why do leaves of some plants change color in the fall?": "Chlorophyll molecules break down first",
  "in plants and other photosynthetic eukaryotes, where does photosynthesis take place?": "Chloroplasts",
  "what are the saclike chlorophyll-containing membranes inside a chloroplast called?": "Thylakoids",
  "what is a stack of thylakoids known as?": "A granum",
  "what is the fluid-filled portion of the chloroplast located outside of the thylakoids?": "Stroma",
  "how does chlorophyll make photosynthesis work?": "It transfers light energy to its own electrons",
  "what are the two reactants in the overall equation for photosynthesis?": "Water and Carbon Dioxide",
  "what are the two main products of the overall photosynthesis equation?": "Sugars and Oxygen",
  "what is the overall process of photosynthesis?": "Using sunlight energy to convert water and CO2 into sugars and oxygen",
  "what is the chemical formula for the 6-carbon sugar produced in photosynthesis?": "C6H12O6",
  "what gas is released as a product of photosynthesis?": "Oxygen",
  "plants use the sugars produced in photosynthesis for what purpose?": "To produce complex carbohydrates like starches",
  "what are the two distinct sets of reactions involved in photosynthesis?": "Light-dependent and Light-independent reactions",
  "what do the light-dependent reactions require the direct involvement of?": "Light and light-absorbing pigments",
  "where in the chloroplast do the light-dependent reactions take place?": "In the thylakoid membranes",
  "what molecule is formed from adp during the light-dependent reactions?": "ATP",
  "what molecule provides the low-energy electrons for the light-dependent reactions?": "Water",
  "what happens to the oxygen atoms from the water molecules that are split?": "They are released to the atmosphere as oxygen gas",
  "what is the electron carrier nadp+ converted to in the light-dependent reactions?": "NADPH",
  "what is transferred to nadp+ to convert it to nadph?": "High-energy electrons",
  "what is the high-energy electron carrier molecule produced by the light-dependent reactions?": "NADPH",
  "where do the light-independent reactions take place?": "In the stroma",
  "what is another name for the light-independent reactions?": "The text does not provide one",
  "what molecules, produced in the light-dependent reactions, are used to power the light-independent reactions?": "ATP and NADPH",
  "what molecule is taken from the atmosphere and used to build sugars in the light-independent reactions?": "Carbon dioxide",
  "what is the main product of the light-independent reactions?": "High-energy sugars",
  "what do the light-independent reactions produce?": "Carbon-containing sugars",
  "how are the light-dependent and light-independent reactions related?": "They are interdependent and work together",
  "what is the ultimate purpose of the two sets of photosynthesis reactions working together?": "To capture sunlight energy and transform it into energy-rich compounds",
  "what is the singular form of \"grana\"?": "Granum",
  "what does the prefix \"chloro-\" in chlorophyll and chloroplast refer to?": "The color green",
  "what form does energy from the sun take when it travels to earth?": "Light",
  "what is the visible spectrum?": "The wavelengths of light visible to our eyes",
  "hhhhh":"NB",
  "the entire weight management plan is fundamentally based on achieving what?": "Calorie Balance",
  "in the context of weight management, what does tdee stand for?": "Total Daily Energy Expenditure",
  "if a person's goal is weight loss, they must consistently create which of the following?": "Calorie Deficit",
  "according to the provided text, what is the most common mistake when reading \"nutrition facts\" panels on food labels?": "Ignoring the Serving Size",
  "what is the recommended healthy, sustainable deficit in calories per day for weight loss?": "300-500 calories",
  "what is the primary purpose of the bmi calculator in step 1 of the plan?": "To set a clear objective (e.g., weight loss, gain, maintenance)",
  "if a person's bmi result is \"overweight,\" what is their likely weight management goal?": "Weight Loss",
  "what is the term for the number of calories your body burns just to stay the same weight?": "Maintenance Calories",
  "which of the following is described as the essential no-calorie \"food\" fundamental to a healthy weight management plan?": "Water",
  "what is a healthy, recommended calorie surplus target for someone aiming to gain weight?": "300-500 calories per day more than TDEE",
  "what is the recommended focus for food choices to help stay full and healthy while in a calorie deficit?": "Protein and fiber",
  "to gain healthy weight, especially muscle, what kind of foods should a person focus on?": "Calorie-dense, nutritious foods",
  "what challenge is common for individuals attempting to create a calorie surplus?": "The physical difficulty of eating enough calories",
  "where should a person look to find the calories and serving size of packaged food?": "The Food Labels",
  "what is the importance of micronutrients (vitamins & minerals) in weight management?": "They do not provide energy/calories but act as catalysts for chemical processes",
  "what is the term used to describe a person with an office job and low physical activity, as used in the \"sarah\" example?": "Sedentary",
  "what unit is the energy stored in food expressed in?": "Calories",
  "what is the calorie (with a capital c) used on food labels actually equal to?": "1,000 calories (kilocalorie)",
  "what is a calorie (lowercase c) defined as?": "The energy needed to raise the temp of 1 gram of water 1 degree Celsius",
  "which of the following macromolecules contains approximately 9 calories (kilocalories) of energy per gram?": "Fats",
  "approximately how many calories (kilocalories) of energy per gram are contained in carbohydrates and proteins?": "4 Calories",
  "when 1 gram of the sugar glucose is burned, approximately how many calories of heat energy are released?": "3,811 calories",
  "the word equation for the overall process of cellular respiration is:": "Oxygen + Glucose → Carbon dioxide + Water + Energy",
  "what is the primary function of food for living things, as described in the text?": "To provide chemical building blocks and chemical energy",
  "the energy stored in different food macromolecules (fats, proteins, carbohydrates) varies because of differences in their:": "Chemical structures and energy-storing bonds",
  "cellular respiration captures the energy from food in how many main stages?": "Three",
  "which of the following is not one of the three main stages of cellular respiration mentioned in the textbook?": "Photosynthesis",
  "what does the term \"glycolysis\" literally mean?": "Sugar-breaking",
  "during glycolysis, one molecule of glucose (a 6-carbon compound) is transformed into how many molecules of pyruvic acid?": "Two",
  "what type of compound is pyruvic acid?": "A 3-carbon compound",
  "what compound is pyruvic acid broken down into during the krebs cycle?": "Carbon dioxide",
  "by what other name is the krebs cycle also known?": "The Citric Acid Cycle",
  "who is the british biochemist that the krebs cycle is named for?": "Hans Krebs",
  "what molecules are used by the electron transport chain to synthesize atp from adp?": "High-energy electrons from glycolysis and the Krebs cycle",
  "approximately how many molecules of atp are released per molecule of glucose when considering glycolysis, the krebs cycle, and the electron transport chain together?": "36 molecules",
  "when a person is hungry and feels weak, what is this your body's way of telling you?": "That your energy supplies are low",
  "what does the overall process of cellular respiration result in the production of, in addition to carbon dioxide and water?": "ATP (Energy)",
  "2025_11_24":"NBBBBBB",
  "what is the fundamental nature of the chemical process known as fermentation?": "It is a catabolic process carried out anaerobically.",
  "what is the primary molecule broken down in the process of fermentation, according to the text?": "Glucose.",
  "fermentation is defined as a process that breaks down molecules under which specific condition?": "Anaerobically.",
  "which organism is explicitly mentioned as carrying out alcoholic fermentation?": "Yeast.",
  "what are the two primary products of alcoholic fermentation, as summarized in the reaction?": "Ethyl alcohol and carbon dioxide.",
  "what molecule, along with nadh, acts as a reactant in the summary equation for alcoholic fermentation after glycolysis?": "Pyruvic acid.",
  "alcoholic fermentation is used in the production of which food items?": "Beer, wine, and other alcoholic beverages.",
  "besides producing alcoholic beverages, what role does alcoholic fermentation play in bread making?": "It causes the bread dough to rise.",
  "what is the specific substance responsible for forming the air spaces (bubbles) seen in a slice of bread?": "Carbon dioxide.",
  "what happens to the small amount of alcohol produced in bread dough during the baking process?": "It evaporates.",
  "lactic acid fermentation converts pyruvic acid into what specific molecule?": "Lactic acid.",
  "how does lactic acid fermentation differ from alcoholic fermentation regarding gas production?": "LAF does not give off carbon dioxide, while AF does.",
  "what are the reactants in the summary equation for lactic acid fermentation after glycolysis?": "Pyruvic acid and NADH.",
  "which molecule, alongside $\\text{nad}^+$, is a product of the overall lactic acid fermentation reaction summary?": "Lactic acid.",
  "lactic acid fermentation of vegetables is a common way of preserving fresh vegetables, including which korean staple?": "Kimchi.",
  "what approximate percentage of salt is added when preserving raw vegetables through lactic acid fermentation?": "2 percent.",
  "lactic acid is described as a waste product during fermentation by certain bacteria important to which industry?": "Food.",
  "which list contains food products made with the help of bacteria that produce lactic acid?": "Cheese, yogurt, and buttermilk.",
  "what substance contributes the familiar sour taste to fermented dairy products like yogurt and sour cream?": "Lactic acid.",
  "what is the role of lactic acid bacteria (lab) often added as a starter culture in cheese making?": "To consume lactose and convert it into lactic acid.",
  "what is the milk sugar consumed and converted by lactic acid bacteria (lab) during cheese making?": "Lactose.",
  "in addition to bacteria, what other organism is mentioned as a lactic acid fermenter?": "Humans.",
  "which cells in the human body are described as being best adapted to producing atp by lactic acid fermentation?": "Muscle cells.",
  "under what condition do many human body cells produce atp by lactic acid fermentation?": "During brief periods without enough oxygen.",
  "how long can the initial supply of atp in muscle cells power a rapid activity, such as the start of a sprint?": "A few seconds.",
  "to keep going after the initial atp supply is used up, an athlete must immediately generate new atp by which two pathways?": "Cellular respiration or lactic acid fermentation.",
  "for a leisurely swim, which process would be able to produce all the atp needed?": "Cellular respiration (aerobic respiration).",
  "sprinters (swimming or running) primarily rely on lactic acid fermentation for what purpose?": "For bursts of quick energy.",
  "how is the \"oxygen debt\" incurred by the swimmers repaid after the race?": "With plenty of heavy breathing.",
  "for exercise that lasts longer than about 90 seconds, what is the only way to continue generating a supply of atp?": "Cellular respiration.",
  "why do well-conditioned athletes have to pace themselves during long races?": "Because cellular respiration releases energy more slowly than fermentation.",
  "in what form does the body primarily store energy in muscle cells and other tissues?": "Glycogen.",
  "what is the body's fuel source after the stores of glycogen are used up (after about 15-20 minutes of activity)?": "Other stored molecules, including fats.",
  "which of the following is regenerated as a product of the overall alcoholic fermentation reaction summary": "NAD+",
  "both alcoholic fermentation and lactic acid fermentation share which crucial function": "they both regenerate NAD+",
  "why is it important to wash your hands before eating?": "To remove dirt and germs",
  "eating fruits and vegetables helps your body by?": "Giving you energy and nutrients",
  "brushing your teeth twice a day helps prevent?": "Tooth decay and cavities",
  "what should you do after using the restroom?": "Wash your hands with soap",
  "why is it important to eat breakfast?": "It gives you energy for the day",
  "which of these is a healthy snack?": "Apple",
  "how many servings of fruits and vegetables should you eat daily?": "Five",
  "drinking plenty of water helps your body to?": "Stay hydrated",
  "what is the best way to prevent spreading germs?": "Washing hands regularly",
  "why should you cover your mouth when you cough or sneeze?": "To prevent spreading germs",
  "which of these foods is high in vitamins?": "Vegetables",
  "regular physical activity helps you by?": "Keeping your body strong and healthy",
  "which is a good hygiene practice?": "Taking regular baths or showers",
  "what should you do before preparing food?": "Wash your hands",
  "eating too much junk food can lead to?": "Feeling sick",
  "why is sleep important for your health?": "It helps you grow and stay healthy",
  "which food group should you eat the most of?": "Vegetables and fruits",
  "what is a balanced diet?": "Eating a variety of foods from all groups",
  "how long should you wash your hands with soap and water?": "20 seconds",
  "which is a benefit of eating healthy foods?": "Feeling more energetic",
  "why should we avoid touching our face with unwashed hands?": "It can transfer germs to our face",
  "what is an example of a whole grain food?": "Brown rice",
  "why is physical exercise important?": "It strengthens your body",
  "what is the recommended amount of sleep for elementary school children?": "9-11 hours",
  "which of these is not a healthy habit?": "Drinking lots of sugary drinks",
  "why is it important to keep your nails clean and trimmed?": "To prevent dirt and germs from collecting",
  "what should you do if you feel sick?": "Tell an adult and rest",
  "which of these is a good source of protein?": "Chicken",
  "what is the purpose of eating a variety of foods?": "To get different nutrients",
  "how often should you brush your teeth?": "Twice a day",
  "which is not a benefit of drinking water?": "Making you tired",
  "why is it important to clean your room regularly?": "To prevent the buildup of dust and germs",
  "what can happen if you don't wash fruits and vegetables before eating them?": "You might consume dirt and pesticides",
  "which meal is often called the most important of the day?": "Breakfast",
  "why should you drink milk or eat dairy products?": "They are high in calcium",
  "what is the best way to dry your hands after washing?": "Using a clean towel or air dryer",
  "which of these habits helps maintain good eyesight?": "Eating carrots and leafy greens",
  "how can you prevent the spread of germs when you're sick?": "By staying home and resting",
  "why should we limit the amount of sugary foods we eat?": "They can lead to health problems",
  "which activity is better for health?": "Playing outside and being active",
  "what should you do if you accidentally cut yourself?": "Clean the wound and cover it",
  "why is fiber important in our diet?": "It helps with digestion",
  "which is a good practice after playing outside?": "Washing your hands and face",
  "what should you do to maintain healthy teeth and gums?": "Brush and floss regularly",
  "why is it important to change your clothes regularly?": "To reduce germs and odors",
  "what should you do before eating to prevent getting sick?": "Wash your hands",
  "what is the best way to stop germs from spreading?": "Washing hands regularly",
  "which of these is a disease you can prevent with a vaccine?": "Measles",
  "what are tiny organisms that can cause diseases?": "Germs",
  "which one is not a healthy habit?": "Eating lots of candy",
  "how can you prevent tooth decay?": "By brushing your teeth regularly",
  "what should you do when you cough or sneeze?": "Cover your mouth with your elbow",
  "which of these is a symptom of illness?": "Running a fever",
  "what is the purpose of a vaccine?": "To prevent diseases",
  "which of these foods can help keep you healthy?": "Fruits and vegetables",
  "which of the following is not a way diseases spread?": "Eating healthy food",
  "what should you do if you feel sick?": "Tell a parent or teacher",
  "how long should you wash your hands?": "20 seconds",
  "what should you use to clean a cut or scrape?": "Clean water and soap",
  "which is a healthy habit?": "Getting enough sleep",
  "which of these is an example of exercise?": "Running or playing sports",
  "how can we prevent the spread of head lice?": "Not sharing hats",
  "what should you do after using the bathroom?": "Wash your hands",
  "which of these can help your immune system?": "Getting vaccinated",
  "which is not a way to stay healthy?": "Avoid sleep",
  "what is a balanced diet?": "Eating a variety of foods from all food groups",
  "how can you keep your body clean?": "By taking regular baths or showers",
  "why is sleep important?": "It helps your body rest and recover",
  "what should you do if someone near you is sick?": "Keep a safe distance",
  "which is a healthy snack?": "Apple",
  "what does it mean to be contagious?": "Able to spread a disease to others",
  "which of these is a non-communicable disease?": "Asthma",
  "how often should you brush your teeth?": "Twice a day",
  "what is the first step in preventing diseases?": "Knowing how they spread",
  "what should you do with fruits before eating them?": "Wash them",
  "which of these can make you sick?": "Germs",
  "why is exercise important?": "It helps keep your body strong and healthy",
  "which habit can help prevent colds?": "Washing hands frequently",
  "which of these is a symptom of allergies?": "Sneezing and itchy eyes",
  "what is hygiene?": "The practice of keeping clean to prevent illness",
  "how can you avoid getting sunburned?": "By wearing sunscreen and a hat",
  "what should you do with a tissue after blowing your nose?": "Throw it in the trash",
  "which of these can help prevent disease?": "Clean environment",
  "who can help you when you are sick?": "A doctor or nurse",
  "what is the role of medicine?": "To help you get better",
  "what is the best way to avoid dehydration?": "Drinking plenty of water",
  "which of these is important for good health?": "Balanced diet and exercise",
  "why are trees important for cleaning the air?": "They produce oxygen",
  "how do plants help prevent soil erosion?": "Their roots hold the soil together",
  "what gas do plants take in that helps reduce air pollution?": "Carbon dioxide",
  "how do trees help provide shade?": "They have big leaves",
  "why are trees important for animals?": "They give shelter and food",
  "what do plants release into the air that humans need?": "Oxygen",
  "how do trees help in making rain?": "They release water vapor",
  "what can planting trees help reduce?": "Global warming",
  "why are plants important for food chains?": "They are producers of food",
  "how do trees help reduce noise pollution?": "They absorb sound",
  "what do plants help to produce that is essential for drinking and agriculture?": "Clean water",
  "why are trees called the \"lungs of the earth\"?": "They produce oxygen and absorb carbon dioxide",
  "how do plants help reduce the amount of carbon dioxide in the atmosphere?": "By absorbing it during photosynthesis",
  "what role do trees play in providing habitat?": "They provide homes for many animals",
  "how do trees affect the climate of an area?": "They help regulate temperature",
  "why is it important to plant more trees?": "To improve environmental health",
  "what happens to wildlife when forests are cut down?": "Animals lose their habitats",
  "how do plants contribute to the water cycle?": "Through transpiration",
  "why are rainforests important to the earth's ecosystem?": "They produce a large amount of oxygen",
  "what do plants provide that is essential for human survival?": "Food and oxygen",
  "how do trees help reduce flooding?": "By absorbing water with their roots",
  "what can we do to help the environment regarding trees?": "Plant and care for trees",
  "which of these is a benefit of urban trees?": "They improve air quality in cities",
  "how do trees help in conserving energy in homes?": "By providing shade that reduces cooling costs",
  "what happens to air quality when there are more trees?": "Air quality improves",
  "why are plants important for the balance of nature?": "They are food and shelter for many organisms",
  "how do plants help in medicine?": "Many medicines are made from plants",
  "what effect do trees have on soil nutrients?": "They enrich soil with nutrients",
  "how do plants affect the amount of oxygen in the atmosphere?": "They increase it",
  "why is deforestation harmful to the environment?": "It leads to loss of biodiversity",
  "how do trees help combat climate change?": "By absorbing greenhouse gases",
  "what is one way that plants contribute to the economy?": "They provide materials like wood and rubber",
  "how do plants help reduce the impact of natural disasters?": "They stabilize the land to prevent landslides",
  "why are plants important for pollinators like bees?": "They provide nectar and pollen",
  "how do plants contribute to the beauty of nature?": "They have colorful flowers and leaves",
  "what is a simple way to help the environment involving plants?": "Plant a tree",
  "how do trees help purify water?": "Their roots filter water in the soil",
  "why is it important to protect forests?": "To ensure wildlife survival",
  "how do plants help reduce stress in humans?": "By providing a calming environment",
  "what is the role of trees in the oxygen-carbon dioxide cycle?": "They produce oxygen and absorb carbon dioxide",
  "how do plants help improve soil quality?": "By adding organic matter when leaves fall",
  "why is it important to learn about plants and trees?": "Because they play a vital role in our environment",
  "what is pollution?": "The presence of harmful substances in the environment.",
  "which of the following is a type of air pollution?": "Smoke from factories releasing into the atmosphere.",
  "which gas is a major contributor to global warming?": "Carbon dioxide",
  "how does water pollution affect aquatic life?": "It can harm or kill them.",
  "what is a common source of noise pollution?": "Loud music from speakers.",
  "which of these is a renewable energy source that can reduce pollution?": "Solar energy",
  "what effect does pollution have on human health?": "Causes diseases and health problems.",
  "which of the following is a way to reduce air pollution?": "Using public transportation.",
  "what is the process by which plants help reduce carbon dioxide levels?": "Photosynthesis.",
  "what is one effect of global warming?": "Melting of polar ice caps.",
  "which of these is a greenhouse gas?": "Carbon dioxide",
  "how can recycling help reduce pollution?": "By reducing the need to produce new materials.",
  "what term describes harmful rain caused by air pollution?": "Acid rain.",
  "which layer of the atmosphere is affected by cfcs leading to ozone depletion?": "Stratosphere.",
  "what is an effect of water pollution on humans?": "Waterborne diseases.",
  "which of these activities contributes to soil pollution?": "Dumping chemicals.",
  "what is the primary cause of global warming?": "Increase in greenhouse gases due to human activities.",
  "which practice helps reduce plastic pollution?": "Recycling and reusing plastic materials.",
  "how does deforestation contribute to pollution?": "By increasing greenhouse gases due to fewer trees.",
  "what is smog?": "A mixture of smoke and fog causing air pollution.",
  "which of these is a consequence of noise pollution?": "Hearing loss.",
  "how does pollution affect animals?": "Can lead to sickness or death.",
  "what is one way to reduce water pollution?": "Treating sewage before releasing it.",
  "which of these is an effect of acid rain on the environment?": "Damages forests and aquatic life.",
  "what is an example of non-point source pollution?": "Runoff from agricultural fields.",
  "which of these gases does not contribute to the greenhouse effect?": "Oxygen.",
  "what does the term \"biodegradable\" mean?": "Can be broken down by microorganisms.",
  "which of the following is a cause of air pollution?": "Car exhaust emissions.",
  "which human activity does not contribute to pollution?": "Using solar panels.",
  "how can individuals help reduce pollution?": "By using reusable bags.",
  "what is eutrophication?": "The depletion of oxygen in water due to excessive nutrients.",
  "which of the following can help reduce soil pollution?": "Practicing crop rotation.",
  "what is the main cause of the hole in the ozone layer?": "Chlorofluorocarbons (CFCs).",
  "which of these is a consequence of deforestation?": "Soil erosion.",
  "what is the term for the contamination of the environment with harmful substances?": "Pollution.",
  "how does planting trees help the environment?": "Helps reduce air pollution.",
  "what is the effect of plastic waste in oceans?": "Harms or kills marine animals.",
  "what can excessive use of fertilizers lead to?": "Water pollution.",
  "which practice does not help reduce pollution?": "Littering.",
  "what is the primary source of noise pollution in cities?": "Traffic and construction.",
  "how does oil spill affect marine life?": "It can poison and kill marine organisms.",
  "what is sustainable development?": "Development that meets present needs without compromising future generations.",
  "what is the first stage in the life cycle of a butterfly?": "Egg",
  "which stage comes after the tadpole in a frog's life cycle?": "Froglet",
  "what process does a caterpillar undergo to become a butterfly?": "Metamorphosis",
  "what do seeds need to begin to grow?": "Air, water, and warmth",
  "what is the young plant inside a seed called?": "Embryo",
  "which animal undergoes metamorphosis during its life cycle?": "Butterfly",
  "what term describes animals born live from their mothers?": "Viviparous",
  "what stage follows the tadpole in a frog's life cycle?": "Froglet",
  "what is a plant that completes its life cycle in one year called?": "Annual",
  "which part of the plant develops into a fruit?": "Flower",
  "what is the process by which plants make seeds?": "Pollination",
  "in which stage does a butterfly spend most of its time eating leaves?": "Larva (Caterpillar)",
  "what do you call the stage when a seed begins to grow?": "Germination",
  "which animal lays eggs during its life cycle?": "Frog",
  "what is the life cycle stage of a frog that lives in water and breathes through gills?": "Tadpole",
  "what is the process called when a seed starts to grow roots and shoots?": "Germination",
  "which of these animals undergoes incomplete metamorphosis?": "Grasshopper",
  "what stage comes after the pupa in a butterfly's life cycle?": "Adult Butterfly",
  "which life cycle stage allows plants to spread to new places?": "Seed",
  "what do we call the transformation process in a frog's life cycle?": "Metamorphosis",
  "which of these is a stage in the life cycle of a flowering plant?": "Seedling",
  "what is the purpose of flowers in a plant's life cycle?": "Reproduction",
  "which animal starts its life cycle in water and moves to land as an adult?": "Frog",
  "what is the term for the shedding of an outer layer during growth in insects?": "Molting",
  "which life cycle stage is not part of a frog's development?": "Pupa",
  "what do we call young plants that emerge from seeds?": "All of the above",
  "during which stage does a butterfly form a protective casing?": "Pupa (Chrysalis)",
  "which of these is a correct sequence in the life cycle of a plant?": "Seed → Seedling → Plant → Flower",
  "what is the main purpose of fruits in the plant life cycle?": "To protect and disperse seeds",
  "which animal lays eggs but is not a bird?": "Frog",
  "what life cycle stage follows the nymph in some insects like grasshoppers?": "Adult",
  "which term describes a plant that lives for more than two years?": "Perennial",
  "what is the first stage in the life cycle of most animals?": "Egg",
  "which process is essential for the reproduction of flowering plants?": "Pollination",
  "what is the young form of an insect that resembles the adult called?": "Nymph",
  "which of these animals undergoes a life cycle that includes a pupa stage?": "Butterfly",
  "what is the main difference between the life cycles of mammals and amphibians?": "Mammals give live birth, amphibians lay eggs",
  "in the plant life cycle, what develops after the flower is pollinated?": "Seed",
  "which stage is missing in the incomplete metamorphosis of insects?": "Pupa",
  "what is the term for the process by which plants make their own food?": "Photosynthesis",
  "which part of the seed provides food for the developing plant embryo?": "Endosperm",
  "what is the correct order of stages in a butterfly's life cycle?": "Egg → Larva → Pupa → Adult",
  "which life cycle involves the stages: egg, nymph, adult?": "Grasshopper",
  "what is it called when animals move from one place to another as part of their life cycle?": "Migration",
  "which stage in the frog life cycle has both gills and lungs?": "Froglet",
  "what are the three main parts of an insect's body?": "Head, thorax, abdomen",
  "which body part of an insect contains its wings and legs?": "Thorax",
  "the head of an insect typically contains which of the following?": "Antennae and eyes",
  "which part of the insect's body is primarily responsible for digestion?": "Abdomen",
  "what role do bees play in the environment?": "Pollination",
  "which of these insects is known for helping in decomposition?": "Beetle",
  "antennae on an insect are used mainly for what purpose?": "Sensing the environment",
  "the thorax of an insect is located between which two body parts?": "Head and abdomen",
  "which insect body part is responsible for reproduction?": "Abdomen",
  "what is the primary role of butterflies in the environment?": "Pollination",
  "insects have how many main body parts?": "Three",
  "which of these is not a part of an insect's body?": "Tail",
  "the exoskeleton of an insect provides what?": "Structural support",
  "which part of the insect is used for sensing smells and sounds?": "Antennae",
  "what role do termites play in the environment?": "Decomposition",
  "which of these insects is a pollinator?": "Bee",
  "the abdomen of an insect contains which of the following systems?": "Digestive and reproductive systems",
  "which body part do insects use primarily for movement?": "Thorax",
  "what is the main function of an insect's compound eyes?": "Seeing",
  "which insect is well-known for decomposing dead plants and animals?": "Housefly",
  "how many legs do most insects have?": "Six",
  "which of these is a role of insects in the environment?": "Pollination",
  "the hard outer shell of an insect is called what?": "Exoskeleton",
  "in which body part are an insect's wings attached?": "Thorax",
  "which part of the insect's body helps it to eat and sense its environment?": "Head",
  "what do ladybugs primarily help control in the environment?": "Pest populations",
  "which of these is not a role of insects?": "Creating clouds",
  "the process by which insects help break down dead matter is called what?": "Decomposition",
  "which insect body part contains the brain?": "Head",
  "insects breathe through tiny holes in their exoskeleton called what?": "Spiracles",
  "what is the main role of ants in the environment?": "Decomposition",
  "which of these is a common pollinator besides bees?": "All of the above",
  "the antennae are located on which part of the insect's body?": "Head",
  "which part of the insect's body is segmented and flexible?": "Abdomen",
  "what role do decomposer insects play in the nutrient cycle?": "They break down organic matter",
  "which of these insects is known for its role in pollination?": "Butterfly",
  "how many pairs of wings do most insects have?": "Two pairs",
  "the insect's thorax is mainly associated with which function?": "Movement",
  "which body part of an insect is responsible for reproduction?": "Abdomen",
  "what do we call insects that help break down dead plants and animals?": "Decomposers",
  "which of these is not a characteristic of insects?": "Warm-blooded",
  "which insect is known for its role in both pollination and producing honey?": "Bee",
  "the mouthparts of an insect are located on which body part?": "Head",
  "insects help plants reproduce by transferring what from one flower to another?": "Pollen",
  "how do deciduous trees respond to cold weather?": "They shed their leaves",
  "what do animals like bears do during winter to survive cold temperatures?": "Hibernate",
  "how does heavy rainfall affect plants?": "Helps them to grow",
  "what do some birds do when the weather gets cold?": "Migrate to warmer areas",
  "what is the effect of drought on plants?": "Plants may wilt and die",
  "how do animals keep cool in hot weather?": "By seeking shade or water",
  "what happens to many animals during winter?": "They hibernate or become less active",
  "how does frost affect plants?": "May damage or kill them",
  "what adaptation helps animals like rabbits blend into snowy environments?": "Changing fur color to white",
  "how do plants survive in very windy areas?": "By developing deep roots",
  "what effect does warm weather have on plants?": "Helps them to grow and produce leaves",
  "how does cold weather affect the behavior of reptiles?": "They bask in the sun to warm up",
  "what is migration?": "Animals moving to new areas due to weather changes",
  "what do plants need to grow that is affected by cloudy weather?": "Sunlight",
  "how do animals prepare for winter?": "Store food or fat",
  "how does strong sunlight affect some animals?": "Leads them to seek shade",
  "what weather condition can cause flooding that affects plants and animals?": "Heavy rain",
  "how do plants conserve water during dry weather?": "By shedding leaves to reduce water loss",
  "what is hibernation?": "Deep sleep during cold weather",
  "how does snow benefit some plants?": "By providing warmth and insulation",
  "which animals are known to migrate due to seasonal changes?": "Monarch butterflies",
  "what effect does strong wind have on seeds?": "Helps in dispersing them",
  "why do some animals grow thicker fur in winter?": "To stay warm in cold weather",
  "how does drought affect animals?": "Causes water scarcity",
  "how does rainy weather help plants?": "By giving them water needed for growth",
  "what do plants need from the sun to make food?": "Light energy",
  "how do some animals protect themselves from extreme heat?": "By burrowing underground",
  "what can cause leaves of plants to fall off?": "Cold weather and shorter days",
  "why do some animals change their behavior in different seasons?": "Due to changes in weather and food availability",
  "how does heavy snowfall affect animals?": "Covers food sources and makes it harder to find food",
  "what effect does temperature have on plant growth?": "Temperature affects the rate of growth",
  "how do cacti survive in hot, dry weather?": "By storing water in their stems",
  "what happens to frogs during cold weather?": "They hibernate in mud",
  "why do leaves change color in autumn?": "Due to changes in daylight and temperature",
  "how does weather affect the blooming of flowers?": "Weather conditions like temperature and rainfall influence blooming",
  "what is one way animals adapt to cold environments?": "By growing thicker fur or feathers",
  "how does sunlight affect animals?": "Regulates their body temperature and behavior",
  "what do squirrels do to prepare for winter?": "Store nuts and seeds",
  "how do plants in wet areas adapt to too much water?": "By developing air spaces in roots and stems",
  "what effect does extreme cold have on plant cells?": "Can cause them to freeze and burst",
  "how do some plants protect themselves from animals during dry seasons?": "By growing thorns or spines",
  "what is the main reason animals migrate?": "To find food and better weather conditions",
  "which concept describes competition for limited resources in a population?": "Struggle for existence",
  "who influenced darwin's idea of the struggle for existence by arguing that populations grow faster than resources?": "Malthus",
  "which term refers to any heritable characteristic that increases an organism's survival and reproduction?": "Adaptation",
  "what does fitness describe in evolutionary terms?": "Ability to survive and reproduce",
  "which process did darwin name as the mechanism by which organisms with favorable variations survive and leave more offspring?": "Natural selection",
  "which of the following is not a characteristic of natural selection?": "It always produces perfect adaptations",
  "which analogy correctly describes artificial selection?": "Farmers breed crops for desired traits",
  "who independently conceived a theory almost identical to darwin's natural selection?": "Wallace",
  "which evidence shows that modern whales evolved from land mammals?": "Vestigial limbs in dolphins",
  "which technology allowed geologists to determine earth's age of approximately 4.5 billion years?": "Radioactive dating",
  "what field studies the distribution of organisms over time and space?": "Biogeography",
  "which are homologous structures?": "Fins of fish and flippers of whales",
  "which are analogous structures?": "Insect wing and bird wing",
  "what did hutton and lyell propose about earth's history?": "It changed gradually over deep time",
  "which structure is the remnant nictitating membrane in the eye?": "Plica semilunaris",
  "in the grasshopper example, which color had higher fitness due to camouflage?": "Green",
  "what drives the unity of life according to evolutionary theory?": "Shared common ancestry",
  "what leads to the diversity of life forms?": "Adaptations to different environments",
  "what is descent with modification?": "Evolution from common ancestors over time",
  "which scientist's ideas were ridiculed before darwin due to radical explanations of evolution?": "Lamarck",
  "which of the following is not a vestigial structure?": "Snake ribs",
  "which component introduces genetic variation each generation?": "Mutation",
  "which statement about natural selection is false?": "It produces perfect organisms",
  "what did darwin use to support his theory of natural selection?": "Observations and data",
  "which of the following involves human choice in breeding?": "Artificial selection",
  "what happens if environmental conditions change faster than species can adapt?": "Extinction",
  "which of these is a physiological adaptation?": "Hibernation",
  "which example is a behavioral adaptation?": "Social behavior",
  "which line of evidence did not exist in darwin's time?": "Genetics and molecular biology",
  "what do homologous structures reveal?": "Common ancestry",
  "which term describes structures that evolved independently in distantly related organisms due to similar environmental pressures?": "Analogous structures",
  "which process caused hawaiian honeycreepers to develop diverse feeding adaptations from a common ancestor?": "Natural selection",
  "what season do many trees lose their leaves?": "Autumn",
  "which animal is known to hibernate during winter?": "Bear",
  "in which season do flowers usually start to bloom?": "Spring",
  "what do birds often do to survive cold winters?": "Migrate",
  "which season has the longest days and shortest nights?": "Summer",
  "how do animals like squirrels prepare for winter?": "Store food",
  "what happens to daylight hours during winter?": "Decrease",
  "which season is known for leaves changing color?": "Autumn",
  "what do some animals do to adapt to colder temperatures?": "Grow thicker fur",
  "in which season are baby animals like lambs often born?": "Spring",
  "why do some plants die back in winter?": "Cold temperatures",
  "what season is typically associated with harvesting crops?": "Autumn",
  "which season do animals like deer grow new antlers?": "Spring",
  "how do some insects survive the winter season?": "Build cocoons",
  "what changes in the environment signal birds to migrate?": "All of the above",
  "in which season do many animals shed their heavy winter coats?": "Spring",
  "what happens to many plants during spring?": "They bloom",
  "why do some animals change color with the seasons?": "To match the environment",
  "which season do animals like bears typically hibernate?": "Winter",
  "what do animals that migrate usually search for?": "Warmer climates",
  "how do plants like evergreens survive winter?": "Produce antifreeze substances",
  "in which season do leaves grow back on deciduous trees?": "Spring",
  "what do frogs do during winter to survive the cold?": "Burrow underground",
  "why do animals like rabbits grow white fur in winter?": "To hide in the snow",
  "which season do we usually see the most butterflies?": "Summer",
  "what is it called when plants stop growing during winter?": "Dormancy",
  "how do fish survive in ponds that freeze over in winter?": "Live in the water below ice",
  "which season has the shortest days and longest nights?": "Winter",
  "what do animals like geese form when migrating?": "V-shaped formations",
  "in which season do many animals have babies?": "Spring",
  "why do some trees lose their leaves in autumn?": "To conserve water",
  "how do bees survive during the winter?": "They stay warm in the hive",
  "what do animals like bears eat a lot before hibernation?": "Fat-rich foods",
  "which season do people often plant new seeds?": "Spring",
  "what happens to some animals' metabolism during hibernation?": "Slows down",
  "why do some animals migrate?": "To find food",
  "in which season do leaves turn red, orange, and yellow?": "Autumn",
  "what is the main reason animals hibernate?": "Lack of food",
  "how do earthworms survive when the ground freezes?": "They burrow deeper underground",
  "which season is known for being cold and snowy in many places?": "Winter",
  "what do animals like rabbits do to stay warm in winter?": "Build shelters",
  "in which season do farmers usually plant crops?": "Spring",
  "how does the change in seasons affect the amount of daylight?": "It changes throughout the year",
  "what do animals like hedgehogs do during cold seasons?": "Hibernate",
  "what is a gene pool?": "All genes present in a population, including all alleles for each gene.",
  "what is allele frequency?": "The number of times an allele occurs in a gene pool divided by the total number of alleles.",
  "in a mouse population of 50 total alleles, 20 are b and 30 are b. what is the allele frequency of b?": "0.4",
  "if the allele frequency of b is 60%, how many b alleles would you expect in a gene pool of 100 alleles?": "60",
  "evolution in genetic terms is defined as:": "Any change in allele frequencies in a population over time.",
  "which of the following statements is true?": "Populations evolve over generations.",
  "natural selection acts directly on:": "An organism’s phenotype.",
  "the genotype of an individual refers to:": "The combination of alleles an individual carries.",
  "the phenotype of an organism is:": "The combination of its genotype and environmental influences.",
  "evolutionary fitness is best defined as:": "An individual's success in passing genes to the next generation.",
  "an evolutionary adaptation is:": "Any genetically controlled trait that increases an individual's fitness.",
  "the genetic definition of a species is:": "A population of interbreeding organisms that do not interbreed with other such groups.",
  "genetically, a population is:": "A group of individuals of the same species that mate and produce offspring.",
  "which of the following is a source of genetic variation?": "Mutations in DNA.",
  "behavioral isolation occurs when:": "Populations evolve differences in courtship rituals or other behaviors that prevent interbreeding.",
  "geographic isolation refers to:": "Populations separated by barriers such as rivers or mountains.",
  "temporal isolation occurs when:": "Species reproduce at different times or seasons.",
  "which example illustrates behavioral isolation?": "Eastern and western meadowlarks using different songs to attract mates.",
  "which example best illustrates geographic isolation?": "Lizards on tepuis mountain plateaus.",
  "which example illustrates temporal isolation?": "Three orchid species that bloom at different times of the year.",
  "a biological island is:": "Any habitat isolated in some way from similar habitats.",
  "what may result when reproductive isolation lasts long enough?": "Formation of new species (speciation).",
  "allele frequency has nothing to do with:": "Whether the allele is dominant or recessive.",
  "studies in population genetics reinforce that:": "Populations evolve over time.",
  "mendel's work on inheritance was rediscovered around:": "1900",
  "which isolating mechanism was not described in the reading?": "Mechanical isolation.",
  "which kingdom includes organisms that lack a nucleus?": "Bacteria",
  "which kingdom is known as the “dustbin kingdom” and contains diverse single-celled eukaryotes?": "Protists",
  "which kingdom stores carbohydrate as starch or sucrose?": "Plants",
  "what is the main carbohydrate storage form in animals?": "Glycogen",
  "which kingdom performs photosynthesis using chloroplasts?": "Plants",
  "which kingdom includes organisms with cell walls made of chitin?": "Fungi",
  "which kingdom contains multicellular organisms capable of complex movement and nervous coordination?": "Animalia",
  "which kingdom can include both unicellular yeast and multicellular mold?": "Fungi",
  "what term describes bacteria that cause diseases like pneumonia?": "Pathogens",
  "which eukaryotic kingdom may be single-celled and includes amoeba?": "Protista",
  "what do bacteria possess that allows them to exchange small dna loops separate from the chromosome?": "Plasmids",
  "which structure allows bacteria to swim through liquid environments?": "Flagella",
  "in which kingdom do organisms feed by secreting extracellular enzymes and absorbing nutrients by diffusion?": "Fungi",
  "which characteristic describes viruses?": "Contain DNA or RNA and a protein coat",
  "which kingdom includes organisms that can be multicellular or unicellular, with hyphae forming a mycelium?": "Fungi",
  "which kingdom is divided into flowering and non-flowering groups?": "Plantae",
  "which kingdom's members are heterotrophic and capable of movement between locations?": "Animalia",
  "which group of organisms is peptidoglycan cell walls associated with?": "Bacteria",
  "which virus infects plants and prevents chloroplast formation?": "Tobacco mosaic virus",
  "which of the following is not in the five kingdoms?": "Viruses",
  "which kingdom can include organisms like chlorella?": "Protista",
  "which term refers to any organism that causes disease?": "Pathogen",
  "which kingdom's organisms lack a true nucleus but have ribosomes?": "Bacteria",
  "which type of multicellularity and cell wall composition combination is correct for fungi?": "Multicellular; chitin",
  "after sprinting around the track, a student's dry mouth and extreme thirst primarily illustrate which biological concept?": "Osmoregulation",
  "a student's teeth chatter and muscles tremble when they step outside for morning announcements on a 0 °c day due to which underlying biological principle?": "Homeostasis",
  "before giving a class presentation, a student's heart races and breathing becomes quick and shallow because of activation of which part of the autonomic nervous system?": "Sympathetic",
  "a student feels lightheaded and almost faints when they stand up suddenly at their locker after sitting because of what immediate physiological change?": "Sudden drop in blood pressure due to gravity",
  "during pe class in 35 °c heat, a student's shirt becomes soaked and droplets of sweat form on their forehead primarily to achieve what?": "Evaporation",
  "despite having eaten dinner three hours ago, a student's stomach growls loudly at midnight while studying, exemplifying which concept?": "Homeostasis",
  "midway through a 3 km run, a student's calf muscle cramps painfully because of what metabolic byproduct?": "Lactic acid accumulation from anaerobic respiration",
  "throughout a bitterly cold, dry winter day, a student's skin feels tight and lips crack because of what phenomenon?": "Increased water loss due to low humidity",
  "a student who leaves home without eating in the morning develops a pounding headache before second period due to which condition?": "Hypoglycemia",
  "during a long study session, a student drinks two liters of water in an hour and then needs to go to the bathroom repeatedly, demonstrating what?": "Osmoregulation",
  "when a student hurries to the second-floor classroom, they take deep, rapid breaths for several minutes to satisfy increased demand for which process?": "Cellular respiration",
  "after exiting the pool, a student's skin feels icy despite the room temperature being 22 °c due to what mode of heat loss?": "Heat loss through conduction in water",
  "a student notices itching and redness developing on their arms minutes after lunch; this is caused by what response?": "Immune response causing histamine release",
  "several hours after skipping breakfast, a student experiences numbness and tingling in their fingers because of which state?": "Hypoglycemia",
  "a student drinks milk that was left out overnight and begins to feel nauseated 20 minutes later due to what mechanism?": "Immune response to bacterial toxins",
  "midway through bench presses, a student's arms feel heavy and they cannot complete the final repetition because of what at the cellular level?": "ATP depletion in muscle cells",
  "a student takes an over-the-counter diuretic and notices a sudden drop in weight and frequent urination because of increased activity in what?": "Increased kidney excretion of water",
  "during a panic episode, a student breathes rapidly and shallowly, then feels dizzy and lightheaded because of what change in blood chemistry?": "Decreased blood CO₂ levels",
  "a student scrolls on their phone until 2 am and then can’t fall asleep for another hour due to disruption of what?": "Circadian rhythm disruption",
  "after drinking four energy drinks in an hour, a student’s hands tremble and they feel jittery due to what effect?": "Increased nervous stimulation",
  "while hiking to a summit at 3,000 m elevation, a student finds it hard to catch their breath and their heart races because of which factor?": "Lower atmospheric oxygen pressure",
  "after a five-hour car ride, a student’s ankles are puffy and they feel discomfort when walking due to what?": "Fluid accumulation due to gravity",
  "a student starts taking a prescribed corticosteroid and notices facial puffiness and weight gain in two weeks because of what?": "Fluid retention due to corticosteroids",
  "following a 90-minute soccer practice, a student feels ravenous and eats more than usual at dinner because of what?": "Increased metabolism and energy expenditure",
  "after doing push-ups for the first time in months, a student’s chest and arm muscles are sore the next day due to what?": "Inflammation from muscle microtears",
  "a student eats extremely spicy noodles and immediately experiences red, warm skin on their face because of what response?": "Vasodilation",
  "after donating a small amount of blood in the health fair, a student’s blood pressure drops and they feel faint and sweaty due to which trigger?": "Hypotension triggering baroreceptors",
  "during a laboratory exercise inside a sealed room, co₂ levels rise and a student’s respiratory rate increases because of what?": "Elevated CO₂ stimulating chemoreceptors",
  "osmoregulation involves the active regulation of which aspect of body fluids?": "Osmotic pressure",
  "what do osmoreceptors detect to initiate osmoregulatory responses?": "Changes in osmotic pressure",
  "in multicellular organisms, hormones are primarily classified as what type of molecules?": "Signaling molecules",
  "homeostasis refers to the body's ability to maintain what?": "Stable internal environment",
  "the autonomic nervous system is a component of which part of the nervous system?": "Peripheral nervous system",
  "which branch of the autonomic nervous system is responsible for the \"fight or flight\" response?": "Sympathetic nervous system",
  "which branch of the autonomic nervous system promotes \"rest and digest\" activities?": "Parasympathetic nervous system",
  "which two structures make up the central nervous system?": "Brain and spinal cord",
  "the peripheral nervous system consists of which of the following?": "All nerves outside the brain and spinal cord",
  "what function does the somatic nervous system control?": "Voluntary movements",
  "blood pressure is measured in which unit?": "Millimeters of mercury (mm Hg)",
  "what is considered normal blood pressure for a healthy adult?": "Less than 120/80 mm Hg",
  "orthostatic hypotension is characterized by what change upon standing?": "A decrease in blood pressure",
  "ghrelin, the \"hunger hormone\", is predominantly secreted by which organ?": "Stomach",
  "leptin, the \"satiety hormone\", is predominantly secreted by which tissue?": "Adipose tissue",
  "what is the primary function of ghrelin?": "Stimulates appetite",
  "what is the primary function of leptin?": "Suppresses hunger",
  "leptin resistance commonly develops in which group of individuals?": "Obese individuals",
  "what is the main effect of insulin on blood glucose?": "Lowers blood glucose",
  "what is the main effect of glucagon on blood glucose?": "Raises blood glucose",
  "hypoglycemia is defined by blood glucose levels falling below what threshold?": "70 mg/dL",
  "which of the following is an early symptom of hypoglycemia?": "Sweating",
  "which of the following is a neurological symptom of hypoglycemia?": "Confusion",
  "which is a severe symptom of hypoglycemia requiring emergency treatment?": "Seizures",
  "an allergy refers to what?": "Immune system's hypersensitivity to certain substances",
  "an allergic reaction refers to what?": "Specific immune response when exposed to an allergen",
  "pollen is classified as which type of allergen?": "Airborne allergen",
  "peanuts are classified as which type of allergen?": "Food allergen",
  "bee stings fall under which allergen category?": "Insect venom allergen",
  "penicillin is an example of which type of allergen?": "Drug allergen",
  "latex is an example of which type of allergen?": "Contact allergen",
  "the autonomic nervous system regulates which of the following processes?": "Involuntary physiological processes",
  "what is the normal diastolic blood pressure range for a healthy adult?": "60–80 mm Hg",
  "which enzyme breaks down starch in the mouth (哪种酶在口腔中分解淀粉)?": "Amylase",
  "what is the product of starch digestion (淀粉消化的产物是什么)?": "Maltose",
  "which enzyme digests proteins in the stomach (哪种酶在胃中消化蛋白质)?": "Pepsin",
  "what is the approximate ph of the stomach (胃的ph大约是多少)?": "2",
  "which enzyme digests fat (哪种酶消化脂肪)?": "Lipase",
  "where does fat digestion mainly occur (脂肪消化主要发生在哪里)?": "Small intestine",
  "which enzyme breaks lactose into simple sugars (哪种酶将乳糖分解为单糖)?": "Lactase",
  "which enzyme breaks sucrose into glucose and fructose (哪种酶将蔗糖分解为葡萄糖和果糖)?": "Sucrase",
  "where are lactase and sucrase found (乳糖酶和蔗糖酶位于哪里)?": "Brush border of small intestine",
  "lack of amylase affects digestion of which nutrient (淀粉酶缺乏影响哪种营养物质的消化)?": "Carbohydrates",
  "pepsinogen deficiency affects digestion of which nutrient (胃蛋白酶原缺乏影响哪种营养物质的消化)?": "Proteins",
  "pancreatic insufficiency leads to poor absorption of which nutrient (胰腺功能不全导致哪种营养吸收不良)?": "Fats",
  "what causes lactose intolerance (乳糖不耐症的原因是什么)?": "Lactase deficiency",
  "sucrase deficiency causes which symptom (蔗糖酶缺乏会导致什么症状)?": "Chronic diarrhea",
  "malabsorption of which nutrient causes oily stools (哪种营养吸收不良会导致油性大便)?": "Fat",
  "which organs secrete most digestive enzymes (哪些器官分泌大部分消化酶)?": "Pancreas and glands",
  "what ensures efficient nutrient absorption (什么确保营养高效吸收)?": "Digestive enzymes",
  "what happens when lactase is missing (缺乏乳糖酶时会发生什么)?": "Gas and diarrhea after milk",
  "where does carbohydrate digestion begin (碳水化合物消化从哪里开始)?": "Mouth",
  "what is the main role of digestive enzymes (消化酶的主要作用是什么)?": "Break macromolecules into smaller units",
  "what is the purpose of cellular respiration (细胞呼吸的目的是什么)?": "Produce ATP",
  "what are the reactants of cellular respiration (细胞呼吸的反应物是什么)?": "Glucose and oxygen",
  "what are the products of cellular respiration (细胞呼吸的产物是什么)?": "CO₂, H₂O and ATP",
  "where does cellular respiration occur (细胞呼吸发生在哪里)?": "Mitochondria",
  "mitochondrial disease reduces production of what (线粒体疾病会减少什么的产生)?": "ATP",
  "which reaction in skin produces vitamin d (皮肤中哪种反应产生维生素d)?": "Photosensitive reaction",
  "why is vitamin d important (维生素d为何重要)?": "Helps calcium absorption",
  "what gas does hemoglobin carry (血红蛋白携带哪种气体)?": "Oxygen",
  "what prevents oxygen binding to hemoglobin (什么会阻止氧与血红蛋白结合)?": "Carbon monoxide",
  "what is the purpose of the urea cycle (尿素循环的主要目的是什么)?": "Detoxify ammonia",
  "which enzyme is part of the urea cycle (哪种酶参与尿素循环)?": "Carbamoyl phosphate synthetase",
  "how is urea removed from the body (尿素如何排出体外)?": "By kidneys",
  "what causes hemophilia (血友病的原因是什么)?": "Lack of clotting factors",
  "which enzyme converts fibrinogen to fibrin (哪种酶将纤维蛋白原转化为纤维蛋白)?": "Thrombin",
  "which enzyme replicates dna (哪种酶复制dna)?": "DNA polymerase",
  "what is the purpose of dna replication (dna复制的目的是什么)?": "Pass genetic information to new cells",
  "which enzyme breaks down acetylcholine (哪种酶分解乙酰胆碱)?": "Acetylcholinesterase",
  "myasthenia gravis affects which system (重症肌无力影响哪个系统)?": "Nervous system",
  "what does atp hydrolysis release (atp水解释放什么)?": "Energy",
  "which enzyme powers muscle contraction (哪种酶驱动肌肉收缩)?": "Myosin ATPase",
  "what does atp stand for (atp的全称是什么)?": "Adenosine triphosphate",
  "how many phosphate groups does adp have (adp有多少个磷酸基)?": "Two",
  "how do cells store energy (细胞如何储存能量)?": "By adding phosphate to ADP",
  "how does atp release energy (atp如何释放能量)?": "By breaking phosphate bonds",
  "why is atp not used for long-term storage (为什么atp不用于长期储能)?": "It is unstable and short-lived",
  "how does the energy in glucose compare to atp (葡萄糖的能量与atp相比如何)?": "Glucose stores about 90 times more",
  "what process converts sunlight into food molecules (哪种过程将阳光转化为食物分子)?": "Photosynthesis",
  "what does “photosynthesis” mean (光合作用的意思是什么)?": "Using light to put together",
  "organisms that make their own food are called (能自己制造食物的生物称为)?": "Autotrophs",
  "organisms that eat other living things are called (通过摄取其他生物获取能量的生物称为)?": "Heterotrophs",
  "what is the process that changes one set of compounds into another (将一组化合物转变为另一组化合物的过程称为什么)?": "Chemical reaction",
  "what are the substances that enter a chemical reaction (进入化学反应的物质叫什么)?": "Reactants",
  "what are the substances formed as a result of a chemical reaction (化学反应生成的物质叫什么)?": "Products",
  "what principle is conserved during chemical reactions (在化学反应过程中保持不变的原则是什么)?": "Mass and energy",
  "which reaction occurs slowly in nature (哪种反应在自然界中发生得很慢)?": "Rusting of iron",
  "what happens when chemical bonds are formed or broken (当化学键形成或断裂时会发生什么)?": "Energy is released or absorbed",
  "what type of reaction releases energy (哪种反应释放能量)?": "Exothermic reaction",
  "what type of reaction requires an external energy source (哪种反应需要外部能量来源)?": "Endothermic reaction",
  "what happens in the reaction of hydrogen and oxygen to form water (氢和氧反应生成水时会发生什么)?": "Energy is released",
  "which process requires electrical energy to occur (哪个过程需要电能才能进行)?": "Splitting water",
  "why do organisms need energy (生物体为什么需要能量)?": "To carry out life processes",
  "what is the main energy source for plants (植物的主要能量来源是什么)?": "Sunlight",
  "how do animals obtain energy (动物如何获得能量)?": "By eating and digesting food",
  "what is the energy required to start a chemical reaction called (开始化学反应所需的能量叫什么)?": "Activation energy",
  "what provides activation energy for paper to burn (是什么为纸的燃烧提供活化能)?": "Flame",
  "why don’t all energy-releasing reactions occur spontaneously (为什么所有放能反应并非都能自发进行)?": "They need activation energy",
  "what determines whether a chemical reaction will occur (什么决定化学反应是否会发生)?": "Energy changes",
  "what is released when hydrogen burns in oxygen (氢在氧中燃烧时释放什么)?": "Heat and light energy",
  "what is the process of converting water into hydrogen and oxygen called (将水分解为氢气和氧气的过程叫什么)?": "Electrolysis",
  "what is the energy needed to start any reaction (开始任何反应所需的能量是什么)?": "Activation energy",
  "what is a catalyst (什么是催化剂)?": "A substance that speeds up a reaction",
  "what are enzymes (什么是酶)?": "Biological catalysts made of proteins",
  "what is the main function of an enzyme (酶的主要功能是什么)?": "To lower activation energy",
  "why are enzymes required for life (为什么生命需要酶)?": "Many reactions are too slow without them",
  "most enzyme names end with which suffix (大多数酶的名称以哪个后缀结尾)?": "-ase",
  "what does carbonic anhydrase do (碳酸酐酶的作用是什么)?": "Speeds up CO₂ + H₂O → H₂CO₃",
  "how much faster can carbonic anhydrase make its reaction (碳酸酐酶可使反应加快多少倍)?": "10 million times",
  "why are enzymes specific (酶为什么具有专一性)?": "Each catalyzes one specific reaction",
  "what are the reactants in enzyme-catalyzed reactions called (酶催化反应的反应物叫什么)?": "Substrates",
  "where do substrates bind on an enzyme (底物在酶上的结合部位是哪里)?": "Active site",
  "what forms when a substrate binds to an enzyme (底物与酶结合后形成什么)?": "Enzyme-substrate complex",
  "what happens to enzymes after a reaction (反应结束后酶会怎样)?": "They are reused",
  "what effect does lowering activation energy have (降低活化能对反应速度有何影响)?": "Increases reaction speed",
  "how are enzymes named (酶是如何命名的)?": "After the reaction they catalyze",
  "at what temperature do most enzymes work best (大多数酶在哪个温度下效果最好)?": "Body temperature",
  "what happens to enzymes at very high temperatures (高温对酶有何影响)?": "They denature",
  "what factors affect enzyme activity (哪些因素影响酶的活性)?": "pH and temperature",
  "what happens when ph is far from optimal (ph偏离最适值时会怎样)?": "Enzyme activity decreases",
  "what type of biomolecule are enzymes (酶属于哪种生物分子)?": "Proteins",
  "what must reactants do for a reaction to occur (反应发生前反应物必须怎样)?": "Collide with enough energy",
  "how many total chromosomes are found in a human somatic cell?": "46",
  "which pair of chromosomes determines biological sex?": "Sex chromosomes",
  "what is the sex chromosome combination for a typical human female?": "XX",
  "what is the sex chromosome combination for a typical human male?": "XY",
  "from where does an individual inherit their chromosomes?": "Half from mother, half from father",
  "homologous chromosomes have the same:": "Gene sequence",
  "where is the centromere located on homologous chromosomes?": "At the same location",
  "what structure connects sister chromatids?": "Centromere",
  "what constitutes a 'duplicated chromosome' as shown in the diagram?": "Two sister chromatids",
  "what proteins does dna wrap around to form nucleosomes?": "Histone proteins",
  "what is the fundamental unit of dna packaging consisting of dna wound around histones?": "Nucleosome",
  "which structure is formed by the coiling of nucleosomes?": "Chromatin",
  "what is the shape of the dna molecule shown in the diagram?": "Double helix",
  "what level of structure comes immediately after 'coils' in the diagram's hierarchy?": "Supercoils",
  "how many individual autosomes (not pairs) are in a human somatic cell?": "44",
  "which numbered pairs represent the autosomes?": "1 through 22",
  "which component is the most zoomed-in (smallest) structure in the dna packaging diagram?": "DNA double helix",
  "what is the name of the uncondensed dna-protein complex?": "Chromatin",
  "approximately how many cells does the average adult human body contain?": "40 trillion",
  "human life begins as how many cells?": "One single cell",
  "what generally happens to a cell after it grows to a certain point?": "It divides",
  "which of the following is one of the two main reasons cells divide rather than continuing to grow?": "To address increasing demands on DNA",
  "as a cell becomes larger, what happens to its efficiency in moving nutrients and waste across the membrane?": "It becomes less efficient",
  "the process by which a cell divides into two new daughter cells is called:": "Cell division",
  "which type of reproduction involves the production of genetically identical offspring from a single parent?": "Asexual reproduction",
  "in most cases of asexual reproduction, how do the two produced cells compare to the parent cell?": "They are genetically identical",
  "what is the specific form of asexual reproduction undergone by prokaryotes like bacteria?": "Binary fission",
  "which animal mentioned in the text reproduces asexually by budding?": "Hydra",
  "sexual reproduction involves the fusion of how many reproductive cells?": "Two",
  "in sexual reproduction, offspring inherit genetic information from:": "Each of two parents",
  "which organisms mentioned in the text reproduce sexually?": "Most animals and plants",
  "what structure on a strawberry plant is the result of sexual reproduction?": "Strawberries (from flowers)",
  "what is a clear advantage of asexual reproduction for single-celled organisms when conditions are right?": "They can reproduce quickly",
  "what is a potential disadvantage of asexual reproduction when environmental conditions change?": "Lack of genetic diversity",
  "which requirement of sexual reproduction can be considered a disadvantage compared to asexual reproduction?": "It requires finding a mate",
  "what is a primary advantage of sexual reproduction?": "It produces genetic diversity",
  "which type of reproduction might be advantageous for species living in environments with seasonal changes?": "Sexual reproduction",
  "some organisms, like the strawberry plant, can reproduce:": "Both sexually and asexually",
  "which of the following best describes the offspring of sexual reproduction?": "A mixture of genetic info from both parents",
  "what eventually happens to the small bud growing off a hydra?": "It breaks off to become an independent organism",
  "which type of reproduction is described as \"relatively simple, efficient, and effective\"?": "Asexual reproduction",
  "all living things must be able to do what by forming new individuals?": "Reproduce",
  "what are the smaller compounds called that join together to form polymers?": "Monomers",
  "what term is used for 'giant molecules' in biology?": "Macromolecules",
  "which elements are found in carbohydrates?": "Carbon, Hydrogen, Oxygen",
  "what is the chemical formula of monosaccharides?": "C6H12O6",
  "what is the chemical formula of disaccharides?": "C12H22O11",
  "which process joins two monosaccharides together with the release of one molecule of water?": "Dehydration Synthesis",
  "what reaction breaks down carbohydrates into their monomer units?": "Hydrolysis",
  "what are polysaccharides?": "Polymers of carbohydrates",
  "how are polysaccharides formed?": "By dehydration reactions",
  "what is the glycemic index (gi)?": "A measure of how quickly food raises blood sugar",
  "which foods do not have a gi?": "Meats",
  "why is gi important for diabetes management?": "It helps manage blood sugar levels",
  "what effect do low-gi foods have on blood sugar?": "They cause a gradual rise",
  "which of the following is not a type of lipid?": "Proteins",
  "why are lipids grouped together?": "Because they are all hydrophobic",
  "what are most lipids composed of?": "1 glycerol and 3 fatty acids",
  "what are the two varieties of fatty acids?": "Saturated and Unsaturated",
  "which of the following is a modified lipid?": "Phospholipids",
  "what is a characteristic of steroids?": "They consist of four fused rings",
  "how can consuming low-gi foods affect insulin sensitivity?": "It improves insulin sensitivity",
  "what is a common factor between lipids and low-gi foods in diabetes management?": "Both help in weight management",
  "what is the first step in testing for fat in a sample?": "Add ethanol",
  "what should you do after adding alcohol to a fat sample?": "Shake the test tube gently",
  "what indicates the presence of fat after the final step of the fat test?": "The solution turns milky white",
  "which of the following is a result of hydrolysis?": "Breaking down of polysaccharides",
  "dehydration synthesis involves the:": "Removal of water to form bonds",
  "what characteristic do all lipids share?": "They are hydrophobic",
  "which of the following is a lipid with a glycerol backbone?": "Triglyceride",
  "what is the primary difference between saturated and unsaturated fatty acids?": "Saturated fats are solid at room temperature, unsaturated fats are not",
  "which of the following statements is true regarding dehydration synthesis?": "It releases water as a byproduct",
  "what type of transport requires energy to move substances against a concentration difference?": "Active transport",
  "which of the following is a characteristic of active transport?": "It requires energy.",
  "what is the role of protein pumps in active transport?": "To move small molecules against their concentration gradient",
  "what process involves the cell membrane forming a pocket to bring materials into the cell?": "Endocytosis",
  "which type of transport is specifically used by white blood cells to engulf foreign particles?": "Phagocytosis",
  "what is the primary difference between facilitated diffusion and active transport?": "Active transport requires energy, facilitated diffusion does not.",
  "which form of endocytosis involves the uptake of liquids?": "Pinocytosis",
  "what is the process of removing large amounts of material from the cell called?": "Exocytosis",
  "which molecule type is commonly transported using protein pumps?": "Calcium ions",
  "which of the following is an example of bulk transport?": "Pinocytosis",
  "how does active transport benefit cells?": "It allows cells to concentrate substances where needed.",
  "what is one reason active transport requires energy?": "Substances move against their concentration gradient.",
  "what is endocytosis?": "The process of taking material into the cell",
  "what type of endocytosis do amoebas use to take in food?": "Phagocytosis",
  "what happens to the cell membrane during exocytosis?": "It fuses with a vesicle and releases its contents.",
  "what is the difference between diffusion and active transport?": "Active transport requires energy while diffusion does not.",
  "what is the energy source for active transport?": "ATP",
  "which of the following is not a form of active transport?": "Facilitated diffusion",
  "which statement describes phagocytosis?": "It involves the engulfing of large particles.",
  "what is a key feature of bulk transport?": "It involves the cell membrane moving large materials.",
  "what process do cells use to remove waste?": "Exocytosis",
  "how does exocytosis differ from endocytosis?": "Exocytosis releases materials out of the cell.",
  "which organelle is most likely involved in active transport?": "Mitochondria",
  "what happens during pinocytosis?": "The cell takes in liquids.",
  "which of the following should be avoided to prevent encountering cobras?": "Passing through snake habitats during early morning or evening hours",
  "what should you do if you see a cobra?": "Back away slowly and maintain a safe distance.",
  "what should you wear to avoid snake bites while walking in potential snake habitats?": "Long pants and high boots",
  "why should you not attempt to suck out snake venom?": "It can cause infection.",
  "what should you do immediately after a cobra bite?": "Stay calm and limit movement.",
  "why is it not recommended to use a tourniquet after a snake bite?": "It can cause tissue damage.",
  "what should you do while waiting for medical help after a snake bite?": "Stay calm and keep the bite area still.",
  "why do movies often portray sucking out venom?": "It adds dramatic tension.",
  "what is a reason cobras may attack?": "If they feel threatened.",
  "what is the best way to avoid encountering a cobra in the wild?": "Stay away from dark and damp places where cobras live.",
  "which behavior is most likely to provoke a cobra?": "Making sudden movements",
  "why is it important to avoid leaving food in areas with snakes?": "It attracts small animals, which in turn attract snakes.",
  "the cell can be divided into two major parts: the nucleus and ________.": "cytoplasm",
  "because many of structures inside cell act like specialized organs, they are known as __________, literally \"little organs.\"": "organelles",
  "the_______ contains nearly all the cell's dna.": "nucleus",
  "_______________, which carry the cell's genetic information, are also found in the nucleus.": "Chromosomes",
  "proteins are assembled on _____________.": "ribosomes",
  "the portion of the er involved in the synthesis of proteins is called rough ___________, or rough er.": "endoplasmic reticulum",
  "the golgi apparatus _______________ proteins and other materials.": "modiﬁes, sorts, and packages",
  "____________ break down lipids, carbohydrates, and proteins into small molecules that can be used by the rest of the cell.": "lysosomes",
  "eukaryotic cells are given their shape and internal organization by a network of protein ﬁlaments known as the ____________.": "cytoskeleton",
  "______________ are the biological equivalents of solar power plants.": "chloroplasts",
  "chloroplasts capture the energy from sunlight and convert it into chemical energy stored in food during_________________.": "photosynthesis",
  "mitochondria convert the chemical energy stored in food molecules into _______": "ATP",
  "all cells contain cell membranes, generally made up of a double-layered sheet called a_____________.": "lipid bilayer",
  "nearly all cell membranes are made up of a lipid bilayer in which ____________ and carbohydrates are embedded.": "proteins",
  "hydrophobic is": "\"water-hating,",
  "hydrophilic is ____________": "water-loving.",
  "most cell membranes are _____________, meaning that some substances can pass across them and others cannot.": "selectively permeable",
  "selectively permeable membranes are also called ____________________": "semipermeable membranes",
  "since most living cells are nearly transparent, ______________ are used to help make cells and their parts visible.": "chemical stains or dyes",
  "electron microscopy, despite its higher resolution, can be used to examine only ___________ cells and tissues.": "nonliving",
  "all cells are surrounded by a thin ﬂexible barrier called a ___________________.": "cell membrane",
  "the ____________________ is a large membrane-enclosed structure that contains genetic material in the form of dna.": "nucleus",
  "_________________________ are cells that enclose their dna in nuclei.": "Eukaryotes",
  "________________________ are cells that do not enclose dna in nuclei.": "prokaryotes",
  "the very ﬁrst photosynthetic organisms to appear on earth, nearly 3 billion years ago, were _____________________": "cyanobacteria",
  "eukaryotic organisms include ____________________ and many unicellular organisms.": "plants, animals, fungi,",
  "in eukaryotic cells, the _______________ separates the genetic material from the rest of the cell.": "nucleus",
  "in __________________, cells are specialized for speciﬁc tasks, such as support, communication, movement, or the production of proteins or other cell products.": "multicellular organisms",
  "______is a state of relatively constant internal physical and chemical condition.": "homeostasis",
  "the process by which particles move from an area of higher concentration to an area of lower concentration is know as _________": "diffusion",
  "the movement of molecules across the cell membrane without using cellular energy is called __________________.": "passive transport",
  "in ____________, molecules that cannot directly diffuse across the membrane pass through special protein channels.": "facilitated diffusion",
  "proteins in the cell membrane act as carriers, or ________, making it easy for certain molecules to cross.": "channels",
  "many cells contain water channel proteins, known as ___________ , that allow water to pass right through them.": "aquaporins",
  "___________ is the diffusion of water through a selectively permeable membrane.": "osmosis",
  "_______________ = above strength,": "hypertonic",
  "______________ = below strength.": "hypotonic",
  "the movement of materials against a concentration difference is known as ________, and it requires energy.": "active transport",
  "_____________ is the process of taking material into the cell by means of infoldings, or pockets, of the cell membrane.": "Endocytosis",
  "many cells also release large amounts of material, a process known as ____________": "exocytosis",
  "during exocytosis, the membrane of the ___________ surrounding the material fuses with the cell membrane, forcing the contents out of the cell.": "vesicle or vacuole",
  "what is the process that changes one set of compounds into another (将一组化合物转变为另一组化合物的过程称为什么)?": "Chemical reaction",
  "what are the substances that enter a chemical reaction (进入化学反应的物质叫什么)?": "Reactants",
  "what are the substances formed as a result of a chemical reaction (化学反应生成的物质叫什么)?": "Products",
  "what principle is conserved during chemical reactions (在化学反应过程中保持不变的原则是什么)?": "Mass and energy",
  "which reaction occurs slowly in nature (哪种反应在自然界中发生得很慢)?": "Rusting of iron",
  "what happens when chemical bonds are formed or broken (当化学键形成或断裂时会发生什么)?": "Energy is released or absorbed",
  "what type of reaction releases energy (哪种反应释放能量)?": "Exothermic reaction",
  "what type of reaction requires an external energy source (哪种反应需要外部能量来源)?": "Endothermic reaction",
  "what happens in the reaction of hydrogen and oxygen to form water (氢和氧反应生成水时会发生什么)?": "Energy is released",
  "which process requires electrical energy to occur (哪个过程需要电能才能进行)?": "Splitting water",
  "why do organisms need energy (生物体为什么需要能量)?": "To carry out life processes",
  "what is the main energy source for plants (植物的主要能量来源是什么)?": "Sunlight",
  "how do animals obtain energy (动物如何获得能量)?": "By eating and digesting food",
  "what is the energy required to start a chemical reaction called (开始化学反应所需的能量叫什么)?": "Activation energy",
  "what provides activation energy for paper to burn (是什么为纸的燃烧提供活化能)?": "Flame",
  "why don’t all energy-releasing reactions occur spontaneously (为什么所有放能反应并非都能自发进行)?": "They need activation energy",
  "what determines whether a chemical reaction will occur (什么决定化学反应是否会发生)?": "Energy changes",
  "what is released when hydrogen burns in oxygen (氢在氧中燃烧时释放什么)?": "Heat and light energy",
  "what is the process of converting water into hydrogen and oxygen called (将水分解为氢气和氧气的过程叫什么)?": "Electrolysis",
  "what is the energy needed to start any reaction (开始任何反应所需的能量是什么)?": "Activation energy",
  "what is a catalyst (什么是催化剂)?": "A substance that speeds up a reaction",
  "what are enzymes (什么是酶)?": "Biological catalysts made of proteins",
  "what is the main function of an enzyme (酶的主要功能是什么)?": "To lower activation energy",
  "why are enzymes required for life (为什么生命需要酶)?": "Many reactions are too slow without them",
  "most enzyme names end with which suffix (大多数酶的名称以哪个后缀结尾)?": "-ase",
  "what does carbonic anhydrase do (碳酸酐酶的作用是什么)?": "Speeds up CO₂ + H₂O → H₂CO₃",
  "how much faster can carbonic anhydrase make its reaction (碳酸酐酶可使反应加快多少倍)?": "10 million times",
  "why are enzymes specific (酶为什么具有专一性)?": "Each catalyzes one specific reaction",
  "what are the reactants in enzyme-catalyzed reactions called (酶催化反应的反应物叫什么)?": "Substrates",
  "where do substrates bind on an enzyme (底物在酶上的结合部位是哪里)?": "Active site",
  "what forms when a substrate binds to an enzyme (底物与酶结合后形成什么)?": "Enzyme-substrate complex",
  "what happens to enzymes after a reaction (反应结束后酶会怎样)?": "They are reused",
  "what effect does lowering activation energy have (降低活化能对反应速度有何影响)?": "Increases reaction speed",
  "how are enzymes named (酶是如何命名的)?": "After the reaction they catalyze",
  "at what temperature do most enzymes work best (大多数酶在哪个温度下效果最好)?": "Body temperature",
  "what happens to enzymes at very high temperatures (高温对酶有何影响)?": "They denature",
  "what factors affect enzyme activity (哪些因素影响酶的活性)?": "pH and temperature",
  "what happens when ph is far from optimal (ph偏离最适值时会怎样)?": "Enzyme activity decreases",
  "what type of biomolecule are enzymes (酶属于哪种生物分子)?": "Proteins",
  "what must reactants do for a reaction to occur (反应发生前反应物必须怎样)?": "Collide with enough energy",
  "the entire weight management plan is fundamentally based on achieving what?": "Calorie Balance",
  "in the context of weight management, what does tdee stand for?": "Total Daily Energy Expenditure",
  "if a person's goal is weight loss, they must consistently create which of the following?": "Calorie Deficit",
  "according to the provided text, what is the most common mistake when reading \"nutrition facts\" panels on food labels?": "Ignoring the Serving Size",
  "what is the recommended healthy, sustainable deficit in calories per day for weight loss?": "300-500 calories",
  "what is the primary purpose of the bmi calculator in step 1 of the plan?": "To set a clear objective (e.g., weight loss, gain, maintenance)",
  "if a person's bmi result is \"overweight,\" what is their likely weight management goal?": "Weight Loss",
  "what is the term for the number of calories your body burns just to stay the same weight?": "Maintenance Calories",
  "which of the following is described as the essential no-calorie \"food\" fundamental to a healthy weight management plan?": "Water",
  "what is a healthy, recommended calorie surplus target for someone aiming to gain weight?": "300-500 calories per day more than TDEE",
  "what is the recommended focus for food choices to help stay full and healthy while in a calorie deficit?": "Protein and fiber",
  "to gain healthy weight, especially muscle, what kind of foods should a person focus on?": "Calorie-dense, nutritious foods",
  "what challenge is common for individuals attempting to create a calorie surplus?": "The physical difficulty of eating enough calories",
  "where should a person look to find the calories and serving size of packaged food?": "The Food Labels",
  "what is the importance of micronutrients (vitamins & minerals) in weight management?": "They do not provide energy/calories but act as catalysts for chemical processes",
  "what is the term used to describe a person with an office job and low physical activity, as used in the \"sarah\" example?": "Sedentary",
  "what unit is the energy stored in food expressed in?": "Calories",
  "what is the calorie (with a capital c) used on food labels actually equal to?": "1,000 calories (kilocalorie)",
  "what is a calorie (lowercase c) defined as?": "The energy needed to raise the temp of 1 gram of water 1 degree Celsius",
  "which of the following macromolecules contains approximately 9 calories (kilocalories) of energy per gram?": "Fats",
  "approximately how many calories (kilocalories) of energy per gram are contained in carbohydrates and proteins?": "4 Calories",
  "when 1 gram of the sugar glucose is burned, approximately how many calories of heat energy are released?": "3,811 calories",
  "the word equation for the overall process of cellular respiration is:": "Oxygen + Glucose → Carbon dioxide + Water + Energy",
  "what is the primary function of food for living things, as described in the text?": "To provide chemical building blocks and chemical energy",
  "the energy stored in different food macromolecules (fats, proteins, carbohydrates) varies because of differences in their:": "Chemical structures and energy-storing bonds",
  "cellular respiration captures the energy from food in how many main stages?": "Three",
  "which of the following is not one of the three main stages of cellular respiration mentioned in the textbook?": "Photosynthesis",
  "what does the term \"glycolysis\" literally mean?": "Sugar-breaking",
  "during glycolysis, one molecule of glucose (a 6-carbon compound) is transformed into how many molecules of pyruvic acid?": "Two",
  "what type of compound is pyruvic acid?": "A 3-carbon compound",
  "what compound is pyruvic acid broken down into during the krebs cycle?": "Carbon dioxide",
  "by what other name is the krebs cycle also known?": "The Citric Acid Cycle",
  "who is the british biochemist that the krebs cycle is named for?": "Hans Krebs",
  "what molecules are used by the electron transport chain to synthesize atp from adp?": "High-energy electrons from glycolysis and the Krebs cycle",
  "approximately how many molecules of atp are released per molecule of glucose when considering glycolysis, the krebs cycle, and the electron transport chain together?": "36 molecules",
  "when a person is hungry and feels weak, what is this your body's way of telling you?": "That your energy supplies are low",
  "what does the overall process of cellular respiration result in the production of, in addition to carbon dioxide and water?": "ATP (Energy)"
}
